[
    {
        "image": "images/slide_1.png",
        "notes": "Welcome to this presentation on our Erasmus+ Cooperation Project, Active Understanding of Groundwater Hydrology and Hydrogeology.\r\u000b- This talk was given at the EGU General Assembly in Vienna on April 28.\u000b- The project is a collaborative effort involving several people and institutions as listed on this slide."
    },
    {
        "image": "images/slide_2.png",
        "notes": "Slide 2 – Global Groundwater Availability and Stress:\r\rThis slide sets the stage for why groundwater management is so important.\u000bThe figure on the left shows the global distribution of water.\r- Only a very small fraction is freshwater — and most of that is locked in glaciers and ice caps, making it largely unavailable for human use.\r\u000bThe accessible portion — the water we can realistically use — is mainly groundwater.\u000b\rThe right figure, from 2011, illustrates the global state of groundwater usage.\u000b- Dark-colored regions indicate areas where groundwater abstraction exceeds mean annual recharge, pointing to unsustainable use.\r- These areas are under significant stress and highlight the urgency of better groundwater management."
    },
    {
        "image": "images/slide_3.png",
        "notes": "Slide 3 – Rising Global Water Demand\r\rThis slide shows the increasing trend in global water abstraction and consumption.\rKey observations:\r- Water use has been rising steadily in recent decades.\r- Future projections indicate a continued increase in demand.\rMain drivers of water demand:\r- Domestic consumption\r- Irrigation and food production\r- Industrial activities\rThis highlights the growing pressure on water resources and the need for sustainable management."
    },
    {
        "image": "images/slide_4.png",
        "notes": "Slide 4 – Quoting John Cherry: Groundwater Scarcity\r\rThis slide reinforces the growing concern about groundwater availability using insights from Professor John Cherry.\rThe figure on the slide shows:\r- The number of months per year with severe water scarcity.\r- Dark red areas indicate regions under persistent water stress.\rKey message from Cherry's statement:\r- \"There is not enough groundwater to satisfy the increasing demand.\"\rAdditional resources:\r- A QR code and link are included on the slide. (https://www.youtube.com/watch?v=I3zqpXxtsHY)\r- These direct you to the full YouTube presentation by John Cherry — an excellent talk for further context."
    },
    {
        "image": "images/slide_5.png",
        "notes": "Slide 5 – The Geoscience Workforce Gap\r\rThis slide highlights a different but critical dimension of the groundwater challenge: the human resource gap.\rAccording to the American Geoscience Institute:\r- By 2029, about 27% of the geoscience workforce will retire.\r- This will create a labor gap of approximately 130,000 full-time geoscientists.\rAt the same time:\r- The figure on the right shows a decline in geoscience degrees awarded by U.S. higher education institutions.\rConclusion:\r- There is a growing mismatch between demand and supply of qualified geoscientists.\r- This underscores the urgent need for more efficient and targeted geoscience education."
    },
    {
        "image": "images/slide_6.png",
        "notes": "Slide 6 – Responding to the Need: The INUX Project\r\rIn response to the growing educational and workforce gap, a new initiative was launched:\r- The Erasmus+ Cooperation Project named INUX.\rThe project brings together a consortium of leading European universities:\r- University Politècnica de Catalunya Barcelona (Spain)\r- University of Gothenburg (Sweden)\r- University of Graz (Austria)\r- Technical University Dresden (Germany)\rThe goal:\r- To strengthen and innovate groundwater education across Europe.\r- To address both scientific challenges and the shortage of skilled professionals."
    },
    {
        "image": "images/slide_7.png",
        "notes": "Slide 7 – Challenges in Groundwater Education\r\rThis slide outlines key challenges in teaching hydrogeology and groundwater management.\r\rQualitative vs. Quantitative Understanding:\r- The figure on the right illustrates the qualitative perspective using drawings and conceptual visuals.\r- In contrast, quantitative understanding requires mathematical modeling and equations.\r- Bridging these two perspectives is a common educational hurdle.\r\rRapid Evolution of Methods:\r- Groundwater science is evolving quickly, especially with new modeling tools and data analysis techniques.\r\rDemand for Coding Skills:\r- There is an increasing expectation for students to be proficient in coding and numerical modeling."
    },
    {
        "image": "images/slide_8.png",
        "notes": "Slide 8 – Further Challenges in Groundwater Education\r\rBeyond content and methods, there are pedagogical challenges to consider:\rDiverse Learner Backgrounds:\r- Students often come from heterogeneous academic backgrounds.\r- This creates varying levels of prior knowledge, especially in math, physics, and geology.\r\rNeed for Time-Efficient Learning:\r- Modern education must be efficient and focused, especially in graduate and professional programs.\r- There is limited time to cover complex concepts thoroughly.\r\rEmphasis on Applied Learning:\r- Groundwater education involves significant learning by doing:\r    - Measuring field data\r    - Interpreting real-world observations\r- Students must develop both practical skills and analytical competence."
    },
    {
        "image": "images/slide_9.png",
        "notes": "Slide 9 – Motivational and Structural Challenges\r\rIn addition to content and teaching methods, we aim to address several motivational and structural challenges:\r\rSparking Interest in Hydrogeology:\r- There is a need to attract more students to hydrogeology and groundwater-related fields.\r- The subject must be made engaging and relevant.\r\rSupporting Lifelong Learning:\r- We also want to reach professionals already in the job market.\r- The project supports flexible and modular learning formats for continued education.\r\rFostering Collaboration:\r- The project aims to initialize and strengthen cooperation across institutions and countries.\r\rEmbracing Digitalization:\r- We are integrating digital tools and online platforms to enhance accessibility and engagement in hydrogeology education."
    },
    {
        "image": "images/slide_10.png",
        "notes": "Slide 10 – Foundations of Groundwater Education\r\rThis slide introduces the existing educational foundations in hydrogeology and groundwater management.\rThese include a range of established methods and materials, which form the starting point for our project.\rThe subsequent slides will provide examples and insights into these approaches:\r- What is currently used\r- How they contribute to learning\r- What can be built upon or improved"
    },
    {
        "image": "images/slide_11.png",
        "notes": "Slide 11 – Interactive Teaching Material\r\rA key element of modern hydrogeology education is the use of interactive digital tools.\rIn our project, we make extensive use of:\r- Jupyter Notebooks – for computational workflows and hands-on coding exercises.\r- Streamlit apps – to create interactive visualizations and simulations.\rThese tools allow learners to:\r- Manipulate plots and parameters dynamically.\r- Explore processes like pumping tests, flow rates, and parameter sensitivity.\r- Gain deeper understanding through experimentation and immediate feedback."
    },
    {
        "image": "images/slide_12.png",
        "notes": "Slide 12 – Video-Based Learning Resources\r\rIn addition to interactive tools, we incorporate a variety of video materials to support learning:\r1. Field and lab experiment demonstration Videos:\r- These videos show real fieldwork setups and measurements.\r- They help students understand where the data come from that are later used in interactive apps and exercises.\r2. Screencasts:\r- We provide recorded tutorials that walk through:\r    - Hand calculations\r    - Software usage relevant to groundwater modeling\r- These videos support step-by-step learning and can be revisited anytime.\rOverall, video resources help make abstract content more tangible and contextualized."
    },
    {
        "image": "images/slide_13.png",
        "notes": "Slide 13 – Question Pools for Assessment\r\rAnother important educational component in our project is the development of question pools.\rThese serve multiple purposes:\r- Self-assessment for learners to check their understanding.\r- Formative and summative assessments, including final exams.\rBenefits of using question pools:\r- They enable reusability and adaptability across courses and institutions.\r- Creating them as a community effort makes the process efficient and fosters shared educational resources.\rThis approach supports scalable and flexible assessment strategies."
    },
    {
        "image": "images/slide_14.png",
        "notes": "Slide 14 – Slide-Based Teaching and Our Tool: SlideJet\r\rIn addition to modern tools, we also rely on classical teaching materials like PowerPoint slides.\r- These are typically shared as handouts with speaker notes, helping guide learners during and after lectures.\rTo enhance this format, we developed our own open-source Streamlit app: SlideJet.\r- SlideJet allows users to convert PowerPoint presentations into interactive Streamlit slideshows.\r- A standout feature: it can automatically translate speaker notes into multiple languages.\rSlideJet is a small but powerful tool that helps bring traditional content into a modern, accessible, and multilingual learning environment.\rMore information about SlideJet under https://github.com/gw-inux/SlideJet/"
    },
    {
        "image": "images/slide_15.png",
        "notes": "Slide 15 – The Aim of the INUX Project\r\rThe main goal of the INUX project is to bring together the different educational components into a coherent and collaborative framework.\rKey objectives include:\r- Structuring and integrating diverse materials: interactive apps, videos, question pools, slides, and more.\r- Facilitating cooperation by forming shared resource pools across institutions.\r- Providing clear guidelines and instructions:\r    - On how to use, adapt, and develop these materials further.\r- Evaluating the impact of these tools in various educational settings:\r    - To assess their efficiency\r    - And their usefulness for learners and educators.\rThe vision is to build a sustainable and flexible ecosystem for groundwater education."
    },
    {
        "image": "images/slide_16.png",
        "notes": "Slide 16 – The INUX Framework: Regional Strengths, Shared Resources\r\rThis slide illustrates the core idea of INUX:\u000bLeveraging the strengths of diverse institutions to build a shared, open, and collaborative educational platform.\rProject partners and their regional focus:\r- University of Gothenburg – Scandinavian region; education e.g., for geology/natural sciences.\r- Technical University Dresden – Central Europe; education e.g., for engineering-oriented students.\r- University of Graz – Alpine and high-mountain environments.\r- UPC Barcelona – Mediterranean region and climate.\rEach university brings:\r- Unique applications, examples, and teaching contexts.\r- A different student profile and learning environment.\rCurrent limitation:\r- Until now, students only had access to their own institution’s materials.\rOur vision:\rOpen up all courses, apps, and examples across the partner institutions.\rExtend access to the wider public, in line with the open-source philosophy of the project.\rPromote cross-institutional learning and knowledge sharing."
    },
    {
        "image": "images/slide_17.png",
        "notes": "Slide 17 – Example Application: Slug Test Evaluation https://slugtest-multilingual.streamlit.app/\r\rThis slide presents a concrete example of the digital materials developed within the INUX project.\rThe featured tool is a small Streamlit application designed for evaluating slug tests, a common field method in hydrogeology.\rKey features of the app:\r- Accessible via QR code on the slide.\r- Includes multilingual translation functionality for speaker notes and interface.\r- Comes with an introductory video that:\r    - Demonstrates the field setup.\r    - Explains how the data are collected, which will be analyzed in the app.\r- An interactive slider allows users to:\r    - Adapt the model solution in real-time.\r    - Visually match it to the measured field data.\rThe tool supports applied, intuitive learning through hands-on exploration."
    },
    {
        "image": "images/slide_18.png",
        "notes": "Slide 18 – Example for a full-course integration: SYMPLE25 (here 1D Groundwater Flow) https://symple25.streamlit.app/\r\rThis slide presents one of the individual learning modules included in the SYMPLE25 app.\rThe topic covered here is one-dimensional groundwater flow — a fundamental concept in hydrogeology.\rThe sub-app allows learners to:\r- Interactively explore how hydraulic gradients drive flow.\r- Adjust parameters to understand steady-state and transient behavior.\r- Connect theoretical understanding with visual and numerical representation.\rThis is part of SYMPLE25’s modular approach to building up knowledge step by step through targeted apps."
    },
    {
        "image": "images/slide_19.png",
        "notes": "Slide 19 – Example Application: SYMPLE25 School https://symple25.streamlit.app/\r\rThis slide showcases another key product of the INUX project: the SYMPLE25 School.\rIt is a one-year continuing education course designed for professionals and lifelong learners.\rThe course is delivered through a streamlined Streamlit app that:\r- Combines multiple smaller apps into a single structured learning environment.\r- Is organized into sections for easy navigation and modular learning.\rAdditional features:\r- Slides from online sessions are integrated directly into the app.\r- Each slide includes multilingual speaker notes to support diverse learners.\r- A QR code provides direct access to the public demo version of the app.\rSYMPLE25 exemplifies how interactive tools and structured content can support flexible, self-paced education."
    },
    {
        "image": "images/slide_20.png",
        "notes": "Slide 20 – SYMPLE25: Tutorials for Self-Paced Learning https://symple25.streamlit.app/\r\rThe SYMPLE25 app also includes structured tutorials to support independent learning.\rEach tutorial consists of:\r- A number of video screencasts that demonstrates e.g., the use of groundwater-related software tools.\r- An accompanying to-do list that guides learners through practical tasks step by step.\rThis structure enables:\r- Self-paced learning, ideal for professionals with limited time.\r- Hands-on experience with tools and workflows used in real-world groundwater management.\rThe tutorial format fosters active engagement and helps build practical competencies."
    },
    {
        "image": "images/slide_21.png",
        "notes": "Slide 21 – Final Example: Pumping Test Analysis Module https://gwp-pumping-test-analysis.streamlit.app/\r\rThis last example features a classical application in hydrogeology: Pumping test analysis.\r\rThe module is distributed via the Groundwater Project (https://gw-project.org/), ensuring open access and global reach.\rIt forms a complete educational unit, including:\r- Theoretical background on pumping tests.\r- Multiple interactive and static pages covering all key aspects:\r    - Test setup\r    - Data collection\r    - Parameter estimation\r    - Result interpretation\rLearners can access the full module using the QR code provided on the slide.\rThis resource combines comprehensive content with interactive learning and supports both teaching and self-study."
    },
    {
        "image": "images/slide_22.png",
        "notes": "Slide 22 – Combining Textbook and Field Data\r\rThis slide provides another insight into the Pumping Test Application Module.\rThe module includes both:\rTextbook datasets – to teach standard procedures and ensure consistent examples.\rField-measured data – to expose learners to the complexities of real-world conditions.\rUsing real data helps students:\rUnderstand the strengths and limitations of various analytical methods.\rLearn how to interpret noisy or incomplete data, just as they would in professional practice.\rThis mix of controlled and realistic data enhances critical thinking and applied problem-solving."
    },
    {
        "image": "images/slide_23.png",
        "notes": "Slide 23 – Conclusion and Outlook\r\rTo conclude, we emphasize the open and collaborative nature of the INUX project:\r- All educational materials are open source and freely available.\r- They are ready to be used, adapted, and extended by educators and learners worldwide.\rWe warmly welcome collaboration and contributions:\r- Whether you’re an instructor, developer, or student — your input can help strengthen and grow this initiative.\rMore information is available:\r- On our project webpage\r- In our GitHub repository, where you can access the materials and tools.\rFinally, we invite you to explore the content of the EGU Splinter Meeting, which is:\r- Presented in a dedicated Streamlit presentation\r- And will be published in the GitHub repository shortly."
    },
    {
        "image": "images/slide_24.png",
        "notes": "Slide 24 – Acknowledgements\r\rThank you very much for your time and interest in our presentation.\r\rWe would like to express our sincere gratitude to:\r- All supporters, sponsors, and project partners\r- The colleagues and collaborators who have contributed to the development of our materials\r- The agencies and institutions that provided funding, infrastructure, and encouragement\r\rThis project is truly a collaborative effort, and we are thankful for the opportunity to advance hydrogeology education together."
    }
]