[
    {
        "image": "images/slide_1.png",
        "notes": "Willkommen zur Grundwasserbewirtschaftung mit Computermodellen – Thema 03: Numerische Lösung der Grundwasserströmungsgleichung\rNachfolgend die wichtigsten Folien, zum Teil mit Kommentaren (Stand 2021 10 28 // 16:00 Uhr; Kommentare werden ggf. noch ergänzt),\rNeben diesen Folien finden Sie im OPAL-Kurs weitere Materialien, u. a. elektronische Kontrollfragen,\rU. a. finden Sie im OPAL-Kurs die auf den folgenden Seiten angesprochenen EXCEL-Sheets und Jupyter-Notebooks\rBei Fragen, Kommentaren und Hinweisen freuen wir uns von Ihnen zu hören."
    },
    {
        "image": "images/slide_2.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_3.png",
        "notes": "Luftbild: Tagebauregion Lausitz\rOben rechts befindet sich der aktive Tagebau\rMittig / unten-links sind geflutete Restlöcher zu erkennen\rEinige typische Fragestellungen, die mit Computermodellen beantwortet werden:\rDimensionierung Entwässerung (Tagebau)\rzukünftiger Wasserstand (Prognose Nach-Bergbau)\rWasserbeschaffenheit\rGrundsätzliches hydrogeol. Verhalten (z. B. Fließrichtung)\r…"
    },
    {
        "image": "images/slide_4.png",
        "notes": "Geologische Struktur\rDie Abbildung zeigt einen regionalen geologischen Schnitt durch die Lausitz (horizontale Ausdehnung mehrere Kilometer)\rDer Schnitt macht deutlich, dass für einige Fragestellungen die geologischen Strukturen stark vereinfacht/abstrahiert als homogene konzipiert werden können"
    },
    {
        "image": "images/slide_5.png",
        "notes": "Analytische Lösung\rFür idealisierte bzw. stark vereinfachte Situationen können entsprechende Rechenmodelle (z. B. 1D Grundwasserströmungsgleichung) mit analytischen Gleichungen gelöst werden\rWeitere Erläuterungen und Anwendung: https://mybinder.org/v2/gh/ThoReimann/HydroTeaching/master (MWW01 ...)"
    },
    {
        "image": "images/slide_6.png",
        "notes": "Geologische Struktur\rDie Folien zeigt einen Ausschnitt aus einem detaillierten hydrogeol. Strukturmodell (horizontale Ausdehnung mehrere 10er meter)\rEs wird deutlich, dass unter Umständen die kleinräumig vorhandenen Strukturen berücksichtigt werden sollen (natürlich abhängig von der Fragestellung)"
    },
    {
        "image": "images/slide_7.png",
        "notes": "Beispiel für ein 2D numerisches Modell\rkomplexe konzeptionelle Modell können nicht mehr mit analytischen Ansätzen gelöst werden\rstattdessen werden numerische Modelle verwendet\rIm Beispiel: Finite-Differenzen Simulation mit der Software ASM (Aquifer Simulation Modell, eine einfache FD Software aus den 1980er Jahren; Kinzelbach)\rBasis ASM: 2D Grundwasserströmungsgleichung"
    },
    {
        "image": "images/slide_8.png",
        "notes": "Beispiel für ein 2D numerisches Modell\rhier dargestellt ist die Verteilung der hydraulischen Leitfähigkeit K (siehe Strukturmodell zwei Seiten vorher)"
    },
    {
        "image": "images/slide_9.png",
        "notes": "Zielstellung / Relevanz des Themas im Rahmen der LV Grundwasserbewirtschaftung mit Computermodellen\rGrundverständnis aber keinen tiefergehenden speziellen Kentnisse\rSie sollten z. B. in der Lage sein, auf mögliche Probleme der Modelle zu reagieren, z. B. wenn ein Modell nicht konvergiert"
    },
    {
        "image": "images/slide_10.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_11.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_12.png",
        "notes": "Zielstellung / Relevanz des Themas im Rahmen der LV Grundwasserbewirtschaftung mit Computermodellen\rGrundverständnis aber keinen tiefergehenden speziellen Kentnisse\rSie sollten z. B. in der Lage sein, auf mögliche Probleme der Modelle zu reagieren, z. B. wenn ein Modell nicht konvergiert"
    },
    {
        "image": "images/slide_13.png",
        "notes": "Fallbeispiel – Dichtwand\r(Hinweis: im WS 21/22 nicht in LV02 besprochen, wird zu einem späteren Zeitpunkt folgen)\rAusgangsproblem: um den Tagebau zu betreiben, muss das Grundwasser um einen signifikanten Betrag abgesenkt werden\rursprünglich ist das Grundwasser flurnah (siehe auch Spreewald)\rdie Absenkung mit Vertikalfilterbrunnen ist weit reichend und Energieaufwändig"
    },
    {
        "image": "images/slide_14.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_15.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_16.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_17.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_18.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_19.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_20.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_21.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_22.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_23.png",
        "notes": "Grundlage\r3D-Grundwasserströmungsgleichung\rkann mit Hilfe eines Kontrollvolumens (linke Seite) hergeleitet werden\rBasis:\rMassenerhalt/Massenbilanz\rGrundwasserströmung nach Darcy\rBei Bedarf ist die Herleitung in Lehrbüchern bzw. in einem Dokument im OPAL-Kurs zu finden"
    },
    {
        "image": "images/slide_24.png",
        "notes": "s. Anderson et al. 2015; chapter 1.6 p16\r(bereits bekanntes) Beispiel für ein Finite-Differenzen-Gitter\rDas Beispiel zeigt einen Nachteil der Finiten-Differenzen-Verfahren: Verfeinerungen im Netz ziehen sich durch das gesamte Modell\rsolche Netze werden auch als strukturiere FD-Gitter bezeichnet"
    },
    {
        "image": "images/slide_25.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_26.png",
        "notes": "FD-Gitter\rDie Abbildung zeigt eine Variante der FD –Verfahren, bei der das Gitter lokal verfeinert wird\rz. B. die Versionen MODFLOW-LGR können solche Gitter generieren\rgut geeignet z. B. für lokale Fragestellungen wie Kontaminationen, Wasserentnahme etc."
    },
    {
        "image": "images/slide_27.png",
        "notes": "Weitere Beispiele für Finite-Differenzen/Finite Volumen\rGrundlage für beide Abbildungen ist das selbe konzeptionelle Modell (Struktur der Oberflächengewässer)\rin der linken Abbildungen kommt ein klassischen strukturiertes FD-Gitter zum Einsatz\rin der rechten Abbildung wird ein unstrukturiertes Finite-Volumen-Verfahren verwendet (z. B. mit MODFLOW-USG/MODFLOW6 realisierbar)"
    },
    {
        "image": "images/slide_28.png",
        "notes": "Beispiel für ein Finite-Elemente-Gitter\rdargestellt ist ein Transportmodell mit einem Finite-Elemente-Gitter (FE)\rverwendete Software im Beispiel ist FEFLOW"
    },
    {
        "image": "images/slide_29.png",
        "notes": "Problemstellung (vereinfachtes Beispiel, bekannte Situation)\rZiel ist die Quantifizierung einer stationären 1D-Strömung in einem gespannten Grundwasserleiter mit horizontaler Basis (Sohle) und konstanter Mächtigkeit m zwischen zwei fest vorgegebenen Potentialhöhen h0 und hL mit Hilfe eines Finite-Differenzen-(FD-) Verfahrens.\rbisher wurde die Aufgabenstellung mit einer analytischen Gleichung gelöst\rNun wird stattdessen ein einfaches numerisches Modell mittels FD-Verfahren aufgebaut"
    },
    {
        "image": "images/slide_30.png",
        "notes": "Gitte und Indizierung\rKnoten bzw. Zellen werden indiziert, um die Zuordnung von Parameterwerten (hydraulische Leitfähigkeit, GWN) und Potentialhöhen zu erleichtern.\rJeder Parameterwert bzw. jede Potentialhöhe ist repräsentativ für eine gesamte Zelle, d. h. innerhalb einer Zelle gibt es keine räumliche Auflösung. \rDie Indizierung erfolgt üblicherweise in Richtung der x-Achse mit i = 1,      i = 2, …, i = n (n = Anzahl von Zellen, hier: n = 11).\rNachfolgend werden folgende Symbole verwendet: Ti, Ni, hi sind die Transmissivität, die GWN bzw. die Potentialhöhe in Zelle i."
    },
    {
        "image": "images/slide_31.png",
        "notes": "Grundlagen für das Gleichungssystem\rSchema zur Herleitung auf der linken Seite in der Draufsicht (Auschnitt mit 3 Zellen)\rRechte Seite in der Seitenansicht"
    },
    {
        "image": "images/slide_32.png",
        "notes": "Grundgleichungen (hier nochmal das gleiche Prinzip aus der Dokumentation von MODFLOW)\rFD-Verfahren zur Simulation der Grundwasserströmung beruhen auf zwei grundlegenden Beziehungen:\rMassen-/Volumenerhalt und\rDarcy-Gesetz\rDiese beiden Beziehungen sind für jede Zelle aufzustellen (außer bei Zellen mit vorgegebener hydraulischer Potentialhöhe, d. h. bei Zellen, in denen eine Randbedingung 1. Art bzw. Dirichlet-Randbedingung vorliegt).\rAus der Kombination von Volumenerhalt und Darcy-Gesetz ermittelt das FD-Verfahren für jede Zelle einen Wert für die Potentialhöhe."
    },
    {
        "image": "images/slide_33.png",
        "notes": "Volumenbilanz\rBasis der Herleitung ist der bereits vorgestellte Ausschnitt mit 3 Zellen (Draufsicht)\rEs wird für die Zelle i die Volumenbilanz aufgestellt (Zu- und Abfluss von und in die Nachbarzellen sowie die flächige Grundwasserneubildung; Fläche für die Grundwasserneubildung ist B mal dx)\rDie halbzahligen Indizes i – 1/2 und i + 1/2 sollen andeuten(!), dass der Durchfluss aus einer bzw. in eine Nachbarzelle erfolgt.\rSelbstverständlich gibt es keine real existierenden Zellen oder Knoten mit halbzahliger Nummer!"
    },
    {
        "image": "images/slide_34.png",
        "notes": "Darcy-Gesetz\rDabei ist T die Transmissivität [L²/T].\rZur Erinnerung: Für einen gespannten Grundwasserleiter ist die Transmissivität das Produkt aus hydraulischer Leitfähigkeit und Mächtigkeit, d. h. T = K·m."
    },
    {
        "image": "images/slide_35.png",
        "notes": "Kombination\rEinsetzen und kürzen…"
    },
    {
        "image": "images/slide_36.png",
        "notes": "FD Abeitsgleichung\rDiese Arbeitsgleichung beinhaltet die Potentialhöhen für die Zelle i und für die beiden Nachbarzellen.\rDadurch entsteht ein Gleichungssystem, d. h. die Arbeitsgleichungen sind miteinander gekoppelt und können nicht isoliert voneinander gelöst werden.\rDieses Gleichungssystem wird von Softwarepaketen „automatisch“ aufgestellt (z. B. MOFLOW).\rAn den Randzellen werden (im betrachteten Beispiel) zudem Werte für die Potentialhöhen h1 und hn vorgegeben.\rModifizierte Überlegungen wären für Zellen mit anderen Randbedingungen erforderlich, z. B. bei einer No-Flow-Bedingung (undurchlässiger Rand) oder einer “river boundary condition“. Hier muss die zugehörige Potentialhöhe jeweils aus einer entsprechenden Arbeitsgleichung bestimmt werden."
    },
    {
        "image": "images/slide_37.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_38.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_39.png",
        "notes": "Einfache Iteration\rZur Durchführung eines einfachen Iterationsverfahrens wird die FD-Arbeitsgleichung nach der Potentialhöhe hi aufgelöst.\rAusgehend von einer Startschätzung werden die Potentialhöhen nach dieser Vorschrift sukzessive verbessert, bis eine vorgegebene Toleranzschranke eingehalten wird.\rBeispiel für Toleranzschranke: Potentialhöhen aus zwei aufeinander folgenden Iterationsschritten dürfen sich um nicht mehr als 1 mm unterscheiden."
    },
    {
        "image": "images/slide_40.png",
        "notes": "Übung / Anwendung\rin den Excel-Sheets zur LV kann der Aufbau des Gleichungssystems nachvollzogen werden\rd. h. es wird für die jweiligen gesuchten Potentialhöhen deutlich, ‘woher’ die Zutaten kommen\res wird klar, dass es sich um ein iteratives Verfahren handelt, d. h. die Potentialhöhen der Nachbarzellen (siehe Gleichung vorige Seite) stammen aus dem vorherigen Iterationsschritte\rmit dem Jupyter Notebook kann besonders gut der iterative Weg zur Lösung nachvollzogen werden\rdie angesprochenen EXCEL-Sheets und Jupyter-Notebooks finden Sie im OPAL-Kurs"
    },
    {
        "image": "images/slide_41.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_42.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_43.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_44.png",
        "notes": "Arbeitauftrag (z. B. in Gruppen…) mit EXCEL / JUPYTER NOTEBOOK\rAufgabe: grafische Anzeige der Parameter (Transmissivität) / Ergebnisse\rAnalyse für gespannten und ungespannt Fall\rT(x)?\rh(x)?\rWelche Veränderungen in der hydraulischen Potentialhöhe ergeben sich, wenn die Mächtigkeit des Aquifers örtlich variiert (Grundwasserneubildung und hydraulische Leitfähigkeit örtlich konstant)? Unterscheiden Sie gespannte und ungespannte Bedingungen."
    },
    {
        "image": "images/slide_45.png",
        "notes": "Das numerische Grundwasserströmungsmodell MODFLOW\rhier erste Vorstellung \rGrundsätzlich arbeitet MODFLOW wie das Beispiel, was gerade hergeleitet/besprochen wurde\rallerdings in 3D und mit einer Vielzahl von möglichen Randbedingungen"
    },
    {
        "image": "images/slide_46.png",
        "notes": "Grundsätze/Charakteristiken iterativer Lösungen\rbasierend auf den bisherigen Erfahrungen (Excel-Sheet, Jupyter Notebook)"
    },
    {
        "image": "images/slide_47.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_48.png",
        "notes": "Motivation (für den Einsatz bzw. Verwendung eines 2D horizontal-ebenen Ansatzes)\rDer Untergrund weist zumeist eine geschichtete Struktur auf, z. B. eine  Abfolge von gut und schlecht leitenden Schichten.  \rDie horizontale Ausdehnung von Schichten ist wesentlich größer als die vertikale Ausdehnung. Daher ist oftmals eine vertikale Mittelung der Grundwasserströmung innerhalb jeder Schicht gerechtfertigt.\rDieses Konzept ist in die Entwicklung vieler Softwarepakete eingeflossen, sodass Grundwassermodelle sehr oft aus 2D-Modellschichten (“layers“) bestehen. „Richtige“ 3D-Modelle sind selten.\rEin reines 2D-Grundwassermodell besitzt nur eine einzige Modellschicht.\rmehr als eine Modellschicht: Quasi-3D-Modell (oder „2D+“).\rModellschichten können mit hydrogeologischen Schichten identisch sein.\rWird eine bessere vertikale Auflösung angestrebt, so wird eine hydrogeologische Schicht durch mehrere Modellschichten abgebildet. \rZwischen Modellschichten kann vertikaler Wassertransfer berücksichtigt werden.\rAquitarde müssen nicht als eigene Schichten abgebildet werden. Die Vorgabe von vertikalen hydraulischen Leitfähigkeiten zwischen benachbarten Modellschichten ist oft ausreichend (“leaky aquifer“)."
    },
    {
        "image": "images/slide_49.png",
        "notes": "2D Gitter\rGrundsätzlich vergleichbar mit dem bisherigen Vorgehen in 1D\rstatt 2 Nachbarzellen wie in 1D gibt es nun 4 Nachbarzellen"
    },
    {
        "image": "images/slide_50.png",
        "notes": "Fünf Punkte Stern\rIn 2D-Finite-Differenzen-Modellen erfolgt die Grundwasserströmung zwischen benachbarten Zellen jeweils parallel zu einer der beiden Koordinatenrichtungen (Doppelpfeile in der Abbildung).\rFD-Gleichungen beruhen auf Volumenbilanz und Darcy-Gesetz. Sie beinhalten Größen aus fünf Zellen (außer an Modellrändern oder bei vorgegebener Potentialhöhe).\rZur Formulierung des Darcy-Gesetzes müssen dabei Leitfähigkeits- oder Transmissivitätswerte für die Zellkanten gebildet werden.\r\rEin gut verständliches Beispiel mit weiteren Vereinfachungen (konstante Transmissivität, einheitliche / gleiche Zellweiten) finden Sie in\rAnderson et al. (2015) ab S. 128 / Box 4.3 “Spreadsheet solution….” sowie\rIm Opal-Kurs (Unterlagen zu LV 03 – Material – Spreadsheet); basierend auf Fox (1996) [Fox, P. J., \"Spreadsheet Solution Method for Groundwater Flow Problems,\" Subsurface Fluid- Flow (Ground-Water and Vadose Zone) Modeling, ASTM STP 1288, Joseph D. Ritchey and James 0. Rumbaugh, Eds., American Society for Testing and Materials, 1996.]"
    },
    {
        "image": "images/slide_51.png",
        "notes": "Mittelung von Transmissivitäten\rTransmissivitätswerte an den Zellkanten entstehen durch Mittelung der Transmissivitäten der beiden jeweils angrenzenden Zellen.\rDabei wird das harmonische Mittel gebildet (Formeln s. o.). \rGrund: Das harmonische Mittel entspricht der effektiven Transmissivität, wenn zwei Bereiche unterschiedlicher Transmissivität nacheinander durchströmt werden."
    },
    {
        "image": "images/slide_52.png",
        "notes": "Block- und Knotenzentrierte FD-Verfahren\rBei blockzentrierten FD-Verfahren (häufigere Variante, wird in „Grundwasserbewirtschaftung mit Computermodellen“ verwendet) werden die Aquiferparameter und die errechnete Potentialhöhe auf eine Zelle bezogen.\rBei knoten- oder gitterzentrierten Verfahren beziehen sich diese Werte auf eine rechteckige Umgebung (schraffiert) des Schnittpunkts von Gitterlinien.\rKnoten sind bei knotenzentrierten Verfahren die Schnittpunkte von Gitterlinien, bei blockzentrierten Verfahren die Zellmittelpunkte."
    },
    {
        "image": "images/slide_53.png",
        "notes": "Instationär\rBei instationären Problemen muss auch die Zeitachse diskretisiert werden. \rdritter Index erforderlich – hier: k\rZeitindex k wird meist oben angeschrieben (kein Exponent!)"
    },
    {
        "image": "images/slide_54.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_55.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_56.png",
        "notes": "Problemstellung\rZur Simulation der Grundwasserströmung muss ein Gleichungssystem gelöst werden. Die Lösungswerte sind die Potentialhöhen für jede Zelle bzw. jeden Knoten.\rDiese Finite-Differenzengleichungen basieren auf dem Volumenerhalt (für jede Zelle) und dem Darcy-Gesetz (Strömung zwischen benachbarten Zellen).\rAufgrund der Größe des Gleichungssystems ist das Gauß-Eliminationsverfahren nicht von Vorteil, da es i. d. R. zuviel Speicherplatz beansprucht (außer bei 1D-Problemen und gespanntem Grundwasserleiter, vgl. vorige Vorlesung).\rDaher werden iterative Lösungsverfahren verwendet.\rBei nichtlinearen Gleichungssystemen (ungespannter Grundwasserleiter) sind iterative Verfahren stets erforderlich (auch bei „unendlichem“ Speicherplatz).\r\rZum Beispiel\rWeitere Informationen finden Sie ggf. in den Unterlagen zum BSc Studium (Prof. Kolditz) oder\rAlternativ in den Unterlagen zur Weiterbildung “Numerical groundwater flow modeling” (Cairo2020) – T04 Numerical solution of groundwater flow"
    },
    {
        "image": "images/slide_57.png",
        "notes": "Weitere Erläuterung\rIm OPAL-Kurs gibt es zu diesem Schema ein Video, welches die Grundzüge der Analyse demonstriert\rDas charakteristische Verhalten eines spezifischen Modells wird durch die schwarze Linie repräsentiert (folgende Seite mit weiteren Beispielen und Modellen, welche ein unterschiedliches charakteristisches Verhalten zeigen)"
    },
    {
        "image": "images/slide_58.png",
        "notes": "Weitere Beispiele\rjeweils unterschiedliches charakteristisches Modellverhalten (hier ‘Modellverhalten’ -> y = F(x))"
    },
    {
        "image": "images/slide_59.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_60.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_61.png",
        "notes": "Schematische Darstellung der Funktionsweise von Iterationsverfahren \rDie Lösung des FD-Gleichungssystems erfolgt nicht in einem Schritt (wie beim Gauß-Eliminationsverfahren), sondern mittels einer Abfolge gleichartiger (Iterations-)Schritte.\rIn jedem Iterationsschritt soll  eine Verbesserung der Näherungswerte für das aktuelle Zeitniveau erzielt werden.\rFür dieses „Update“ wird jeweils das Zwischenergebnis des vorhergehenden Schrittes benutzt."
    },
    {
        "image": "images/slide_62.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_63.png",
        "notes": "Startwerte\rIterationszähler ν = 0\rBei zeitabhängigen Problemen sind die Startwerte üblicherweise identisch mit den Ergebnissen des vorhergehenden Zeitschritts (bzw. den Anfangswerten).\rAusnahme: Zellen mit Festpotentialrandbedingung (Potentialhöhen sind zum Zeitniveau k bekannt, kein „Update“ nötig)\rBei stationären Problemen müssen Startwerte vorab geschätzt werden mittels:\rautomatischer Vorgabe durch die Software\rErfahrung\rinstationärer Modellierung mit allmählicher Annäherung an den stationären Zustand"
    },
    {
        "image": "images/slide_64.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_65.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_66.png",
        "notes": "Zur Wahl von Toleranzschranke und max. Iterationszahl\rEine Verringerung (Erhöhung) des Wertes für die Toleranzschranke zieht eine Erhöhung (Verringerung) der benötigten Anzahl von Iterationsschritten bzw. der benötigten Rechenzeit nach sich.\rJe kleiner die Toleranzschranke gewählt wird, umso genauer wird i. d. R. die Lösung der FD-Gleichungssystems angenähert, solange das Iterationsverfahren konvergent bleibt (ggf. νmax  anpassen).\rAusnahme: Toleranzschranken in der Nähe der Rechnergenauigkeit können zu Rundungsfehlern und damit zu geringerer Genauigkeit führen.\rFaustregel Die Toleranzschranke sollte eine Größenordnung unter der angestrebten Modellgenauigkeit liegen.\rBeispiel: Berechnung von h auf 0.01 m genau bedeutet ε = 0.001 m.\rStarke hydraulische Kontraste können jedoch kleinere Toleranzschranken erfordern.  \rVorgehen bei der Wahl der maximalen Iterationszahl:\rVoreinstellung des Softwarepakets übernehmen\rbei fehlender Konvergenz ggf. erhöhen"
    },
    {
        "image": "images/slide_67.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_68.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_69.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_70.png",
        "notes": "No notes"
    }
]