[
    {
        "image": "images/slide_1.png",
        "notes": "Willkommen zur Grundwasserbewirtschaftung mit Computermodellen –Thema 05: Kalibrierung von Grundwassermodellen\rIn den Folien und Kommentaren finden Sie die Grundlagen zur Modellkalibrierung\rNeben diesen Folien finden Sie im OPAL-Kurs weitere Materialien, u. a. elektronische Kontrollfragen,\rBei Fragen, Kommentaren und Hinweisen freuen wir uns von Ihnen zu hören."
    },
    {
        "image": "images/slide_2.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_3.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_4.png",
        "notes": "Vorwärts und Inversmodellierung\rbisher: Vorwärtsmodellierung (z. B. Beleg Teil 1)\rDas bedeutet:\rAlle Modelleingangsdaten (GWN, Leitfähigkeit, Speicherkoeffizient, \tPumpraten, Flusswasserstände, Porositäten, Dispersivitäten, Zugabekonzentrationen usw.) sind bekannt bzw. können zuverlässig abgeschätzt werden.\rMit diesen Informationen lässt sich dann die Grundwasserströmungs- bzw. die Stofftransportgleichung numerisch lösen.\rBei nahezu allen praktischen Problemstellungen ist allerdings ein Teil der Modelleingangsdaten (Werte und / oder Zonen) nicht bekannt oder kann nur grob abgeschätzt werden.\rDafür stehen jedoch Messwerte oder Zeitreihen (zumeist für Potentialhöhen und Konzentrationen, manchmal auch für Durchflüsse / Schüttungen bzw. Stofffrachten) zur Verfügung, die mit Modellergebnissen verglichen werden können.\rInversmodellierung bzw. Parameterschätzung bzw. Modellkalibrierung bzw. Modelleichung bedeutet, die fehlenden oder nur ungenau bekannten Parameterwerte und Zonen so zu bestimmen, dass die Modellergebnisse möglichst gut mit den zugehörigen Messinformationen übereinstimmen. (z. B. Pumpversuchsauswertung)"
    },
    {
        "image": "images/slide_5.png",
        "notes": "Schema zur Inversmodellierung\rAuch: Parameteridentifikation\rAus Eingangsdaten (z. B. Randbedingungen) und Messwerten werden die Modellparameter ermittelt\rBeispiel: Auswertung eines Pumpversuches"
    },
    {
        "image": "images/slide_6.png",
        "notes": "Abweichung Berechnet – Gemessen\rDie Abbildung zeigt den zeitlichen Verlauf der Modellrechnung (blaue Linie)\rZu einigen Zeiten sind Beobachtungswerte (Messungen) vorhanden (rote Punkte)\rAls Residual wird die Abweichung zwischen gemessenen und berechneten Werten bezeichnet\rDas Ziel der Kalibrierung besteht darin, die Abweichung zwischen gemessenen und berechneten Werten zu minimieren"
    },
    {
        "image": "images/slide_7.png",
        "notes": "Schema zur Vorwärtsmodellierung\rAuch: Prognose / Vorhersage / Systemanalyse etc.\rAusgangspunkt ist das Modell mit Eingangsdaten (z. B. Randbedingungen) und Parametern\rim Ergebnis berechnet das Modell die gewünschte Zielgröße (z. B. Druckpotentiale / Wasserstände)"
    },
    {
        "image": "images/slide_8.png",
        "notes": "Beispiel\rstationäres Grundwassermodell\rRandbedingung 1. Art vorgegeben (Festpotential)\r8 Messstellen mit Potentialhöhen\rZonierung vorgegeben\rPer Modellkalibrierung zu bestimmen sind die Werte für GWN und Transmissivität.\rErhält man in diesem Beispiel eindeutige Parameterwerte?\rVereinfachte Variante (Übung in der LV: 1D Grabenanströmung – https://gwf-1d-unconf-calib.streamlit.app/\r)"
    },
    {
        "image": "images/slide_9.png",
        "notes": "Beispiel\rstationäres Grundwassermodell\rRandbedingung 1. Art vorgegeben (Festpotential)\r8 Messstellen mit Potentialhöhen\rZonierung vorgegeben\rPer Modellkalibrierung zu bestimmen sind die Werte für GWN und Transmissivität.\rErhält man in diesem Beispiel eindeutige Parameterwerte?\rVereinfachte Variante (Übung in der LV: 1D Grabenanströmung - https://gwf-1d-unconf-calib.streamlit.app/\r)"
    },
    {
        "image": "images/slide_10.png",
        "notes": "Beispiel\rhttps://gwf-1d-unconf-calib.streamlit.app/\rDaten für Kalibrierung einblenden und Modell kalibrieren\rWie gut stimmen die angepassten Parameter mit der ‘Realität’ (= bekannt) überein?"
    },
    {
        "image": "images/slide_11.png",
        "notes": "Ablauf\rModellkalibrierung ist ein „iteratives Verfahren“.\rDas nebenstehende Ablaufschema ist mehrfach abzuarbeiten, bis eine zufriedenstellende Abweichung zwischen Modellergebnissen und Messwerten erreicht ist.  \rDie einzelnen Schritte erfolgen zumeist (noch) nicht vollautomatisch, sondern von Hand.\rExpertenwissen (Geohydraulik, Standorteigenschaften) ist insbesondere bei der Parameteranpassung gefordert."
    },
    {
        "image": "images/slide_12.png",
        "notes": "Fallbeispiel (bekannt aus T04 – Stofftransport)\rAnwendung des kalibrierten Modells für die Prognose der zukünftigen Entwicklung\rdie linke Seite zeigt das (regionale) Modell\rdie rechte Seite zeigt die Kalibrierung (keine perfekte Übereinstimmung… d. h. diese ist praktisch nicht immer möglich)"
    },
    {
        "image": "images/slide_13.png",
        "notes": "Fallbeispiel (bekannt aus T04 – Stofftransport)\rAn dieser Stelle ist die Progose auf der Basis der kalibrierten Modells dargestellt"
    },
    {
        "image": "images/slide_14.png",
        "notes": "Schwerpunkte\rDie Schritte und das Vorgehen zur Kalibrierung werden anhand von Beispielen und Übungsaufgaben besprochen;\rEin kurzer Überblick zur automatischen Kalibrierung folgt zum Ende;\rDie folgenden Themen (ab Besonderheiten bei der Kalibrierung instationärer Modelle) folgen in der LV am 13. Januar 2022 (T05 – Teil III)\rDas Ablaufschema zur Modellierung (Abbildung rechts) aus Anderson und Woessner 2003 zeigt nochmal, an welcher Stelle im Ablauf der Grundwassermodellierung die Kalibrierung eingeordnet wird"
    },
    {
        "image": "images/slide_15.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_16.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_17.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_18.png",
        "notes": "Ablauf der Kalibrierung\rDas Schema zeigt die nachfolgenden inhaltlichen Schwerpunkt im Ablauf einer Kalibrierung\r(1) Kalibrierparameter (welche?)\r(2) Beobachtungen / Zielfunktion (welche/wieviele/…)\r(3) Kriterien / Erfolgskontrolle\r(4) Parameteranpassung (‘nächster Schritt’ …)"
    },
    {
        "image": "images/slide_19.png",
        "notes": "Auswahl der Kalibrierparameter\rAls Kalibrierparameter grundsätzlich geeignet sind Parameter, deren\rWerte und / oder Zonierung nicht genau bekannt sind,\rÄnderungen sich merklich auf das Strömungsverhalten auswirken würden.\rParameter, die diese beiden Kriterien erfüllen, lassen sich üblicherweise bereits während des Modelldesigns identifizieren.\rDabei erhält man auch Abschätzungen für die Parameterwerte und die Zonenausdehnung, die dann für den ersten Eichschritt verwendet werden.\rDiese erste Modellvorstellung (Zonierung) ist zumeist „einfach“ und kann in späteren Eichschritten bei begründetem Bedarf und verfügbarer Messinformation erweitert werden.\rBeispiele für Kalibrierparameter:\rGrundwasserneubildung\rhydraulische Leitfähigkeit bzw. Transmissivität\rSpeicherkoeffizient (nur bei instationären Problemstellungen)\rvertikale hydraulische Leitfähigkeit zwischen Aquiferstockwerken\rLeakage-Faktor bei Fließgewässern oder Drainagerohren\rDispersivitäten (longitudinal, transversal)"
    },
    {
        "image": "images/slide_20.png",
        "notes": "Vorwärtsmodellierung\rEine numerische Berechnung der Potentialhöhen (als Ergebnis der vorhandenen Parameter und Randbedingungen)"
    },
    {
        "image": "images/slide_21.png",
        "notes": "Noch ein paar einführende Bemerkungn\rZusätzlich zu den Parameterwerten ist oftmals auch die Zonierung nicht bekannt und muss mittels Modellkalibrierung ermittelt werden.\rFür unterschiedliche Parameter (z. B. GWN, Transmissivität) sind i. d. R. auch die zugehörigen Zoneneinteilungen verschieden.\rParameter, die mittels Kalibrierung bestimmt werden sollen, werden als Kalibrierparameter oder Eichparameter bezeichnet (im Beispiel von der vorigen Seite: GWN und Transmissivität).\rZiel der Kalibrierung ist es, die Abweichungen der Modellergebnisse hmod von den Messwerten hgem (bzw. Cmod von Cgem) möglichst stark zu verringern.\rDabei sind geologische und hydrogeologische Kenntnisse über das Modellgebiet zu berücksichtigen.\rInsbesondere sind unnötig komplexe Zonierungen zu vermeiden, die nicht durch geologische / hydrogeologische Informationen gestützt werden („möglichst einfache Modellstruktur“).\rFaustregeln (für die klassische manuelle Kalibrierung): \rAnzahl Kalibrierparameter : Abweichungen zwischen hmod und hgem bzw. zwischen Cmod und Cgem \rAnzahl Kalibrierparameter : Belastbarkeit der Kalibrierparameter "
    },
    {
        "image": "images/slide_22.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_23.png",
        "notes": "Ablauf der Kalibrierung\rDas Schema zeigt die nachfolgenden inhaltlichen Schwerpunkt im Ablauf einer Kalibrierung\r(1) Kalibrierparameter (welche?)\r(2) Beobachtungen / Zielfunktion (welche/wieviele/…)\r(3) Kriterien / Erfolgskontrolle\r(4) Parameteranpassung (‘nächster Schritt’ …)"
    },
    {
        "image": "images/slide_24.png",
        "notes": "Messwerte\rMesswerte bilden die Vergleichsgrundlage für die Modellergebnisse.\rWie schon erwähnt stehen zumeist Potentialhöhen und Stoffkonzentrationen, seltener Durchflüsse / Schüttungen bzw. Massenströme (Stofffrachten) zur Verfügung. (siehe auch Beispiel 0-a vom Beginn!)\rVorab-Informationen (“prior information“) über die Kalibrierparameter gehören nicht zu den Messwerten, die im Diagramm genannt sind!\rFür eine stationäre Modelleichung (häufig der Fall bei Strömungsmodellen) ist es wichtig, dass die Messwerte unter stationären oder zumindest nahezu stationären Fließverhältnissen ermittelt wurden.\rDies bedeutet u. a., dass kurz vor den Messungen keine Änderungen der Randbedingungen (GWN, Pumpraten, Flusswasserstände o. dgl.) erfolgt sein dürfen.\rMessungen unterschiedlicher Größen (z. B. Potentialhöhen und Quellschüttungen) sollten unter den gleichen Bedingungen erfolgt sein."
    },
    {
        "image": "images/slide_25.png",
        "notes": "Beobachtungen / Zielfunktion\rAnzahl der Beobachtungen – u. a. Zeiten mit vielen Messungen vs. Zeiträume mit weniger Messungen\rArten der Beobachtungen (z. B. Wasserstände, Abflüsse, Konzentrationen) – siehe Beispiel Freiheit spring aus LV07\rWichtung der Beobachtungen (Lage im Modellrand vs. Lage im zentralen Bereich des Modells)\rDie entsprechenden Aspekte können mit spezifischen Wichtungsfaktoren berücksichtigt werden (z. B. Abweichung_rand x 0.1)"
    },
    {
        "image": "images/slide_26.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_27.png",
        "notes": "Beispiel – Bedeutung von Beobachtungswerten (nach Poeter 2003 - https://inside.mines.edu/~epoeter/583/)\rEinfache Ausgangssituation (dargestellt in Draufsicht)\rGegeben sind zwei Beobachtungswerte in Form von Druckpotentialen (Wasserstände)\rFrage 1) [Antwort: …]\rFrage 2) [Antwort: …]"
    },
    {
        "image": "images/slide_28.png",
        "notes": "Beispiel – Bedeutung von Beobachtungswerten (nach Poeter 2003 - https://inside.mines.edu/~epoeter/583/)\rBeispiel zum eigenen ausprobieren"
    },
    {
        "image": "images/slide_29.png",
        "notes": "Zonierung (Beispiel)\rTheoretisch können in einem distributive numerischen Modell für jede diskrete Zelle separate Parameter verwendet werden\rz. B. bei 10 x 10 Zellen wären 100 verschiedene K-Werte möglich\rPraktisch ist für die Kalibrierung eine Zonierung notwendig\rIn den Zonen werden (üblicherweise) gleiche Parameter angenommen\rDas Beispiel zeigt ein Gebiet (Draufsicht), welches durch Pumpversuche hydrogeologisch erkundet ist"
    },
    {
        "image": "images/slide_30.png",
        "notes": "Zonierung (Beispiel)\rAuf der Basis der in den Pumpversuchen ermittelten hydraulischen Leitfähigkeiten werden Zonen definiert\r(dieses Vorgehen ist im Beispiel relevant; praktisch wird die Zonierung der geohydraulischen Parameter auch z. B. anhand von hydrogeologischen Strukturen definiert)"
    },
    {
        "image": "images/slide_31.png",
        "notes": "Zonierung (Beispiel)\rZonierung der Grundwasserneubildung, z. B. auf Basis der Landnutzung (siehe auch eine der nachfolgenden LV zur Grundwasserneubildung)"
    },
    {
        "image": "images/slide_32.png",
        "notes": "Beispiel – Bedeutung von Beobachtungswerten (nach Poeter und Hill 1997; https://ngwa.onlinelibrary.wiley.com/doi/10.1111/j.1745-6584.1997.tb00082.x)\rEinfache Ausgangssituation (dargestellt in Draufsicht)\rGegeben sind drei (oder mehr) Beobachtungswerte in Form von Druckpotentialen (Wasserstände)\rFrage 1) [Antwort: …]\rFrage 2) [Antwort: …]"
    },
    {
        "image": "images/slide_33.png",
        "notes": "Übungsbeispiel 0-b\rDie gemessenen Werte an Mst. 1 und Mst. 2 können kalibriert werden\rSituation ist vergleichbar mit 1D Grabenanströmung\rKalibrierparameter GWN und K (K durch Messungen annähernd bekannt)"
    },
    {
        "image": "images/slide_34.png",
        "notes": "Übungsbeispiel 0-b\rZur Lösung kann das XLS Sheet aus T03 verwendet werden\rAlternativ auch möglich: einfachen 1D Strömungsmodell mit MODELMUSE aufbauen (s. OPAL Kurs)"
    },
    {
        "image": "images/slide_35.png",
        "notes": "Übungsbeispiel 1\rgleiche Situation wie in Übungsbeispiel 0-b zuvor ABER\randere Potentialhöhen werden gemessen"
    },
    {
        "image": "images/slide_36.png",
        "notes": "Übungsbeispiel 1\rDas Beispiel lässt sich nicht mit dem ursprünglichen konzeptionellen Modell kalibrieren (homogeny)\rEs kann angenommen werden, dass sich (z. B.) zwischen den Messstellen eine andere geologische Struktur befindet (z. B. Schluff)\rMit dieser Annahme (geol. Struktur zwischen den Mst. kann kalibriert werden\rFazit:\rModell zeigt, dass der ursprüngliche konzeptionelle Ansatz nicht geeignet ist\rModell zeigt einen alternativen Ansatz (der durch weitere Erkundungsmassnahmen bestätigt werden kann / sollte)"
    },
    {
        "image": "images/slide_37.png",
        "notes": "Kalibrieren im Ablauf einer numerischen Simulation\rÜbungsbeispiel 1 steht repräsentativ für den roten Pfeil\rIn Folge der Kalibrierung wird auch das konzeptionelle Modell angepasst"
    },
    {
        "image": "images/slide_38.png",
        "notes": "Konzeptionelles Modell – Unsicherheiten\rAbbildungen zeigen verschiedene mögliche konzeptionelle Modelle (Varianten)\rweitere Informationen https://agupubs.onlinelibrary.wiley.com/doi/full/10.1029/2020WR027578 (Open Access)"
    },
    {
        "image": "images/slide_39.png",
        "notes": "Konzeptionelle Unsicherheit – Im Ablauf der Modellierung berücksichtigen\rdie Abbildung zeigt zwei Möglichkeiten, konzeptionelle Unsicherheit zu berücksichtigen\rConsensus approach:\rDas konzeptionelle Modell wird schrittweise optimiert\rMulti-modell approach:\rEine Vielzahl von möglichen konzeptionellen Modellen wird von Beginn an betrachtet\rDie Modelle, welche nicht kalibriert werden können (d. h. können das reale Systemverhalten nicht abbilden) werden verworfen"
    },
    {
        "image": "images/slide_40.png",
        "notes": "Übungsbeispiel 2\rEs liegen die K-Werte und die GWN als Zone vor\rDas (Einzugs)Gebiet wird an einer Seite durch eine definierte Potentialhöhe begrenzt (RB 1.Art)"
    },
    {
        "image": "images/slide_41.png",
        "notes": "Übungsbeispiel 2\rhttps://gwf-1d-unconf-noflow-calib.streamlit.app/\rNochmal vereinfacht: keine Zonierung von K-Werten und GWN"
    },
    {
        "image": "images/slide_42.png",
        "notes": "Übung 2\rModellergebnisse an gegebene Messungen durch Variation von K1/K2?GWN1/GWN2 anpassen\rACHTUNG: Pro Kalibrierschritt nur einen Parameter ändern"
    },
    {
        "image": "images/slide_43.png",
        "notes": "Beispielaufgabe\rähnlich wie Übung2 aber hier nur homogene GWN\rLösung z. B. mit XLS oder FloPy nachvollziehen\rTIP:\rausgehen vom defnierten Potential am Rand\rK-Wert ändert den Gradient des WSP local\rGWN ändert Gradient (da mehr / weniger Abfluss) im gesamten Modell"
    },
    {
        "image": "images/slide_44.png",
        "notes": "Zwischenfazit\rpraktische ‘Stolperstellen’ angesprochen (ungeeignete Beobachtungswerte usw.)"
    },
    {
        "image": "images/slide_45.png",
        "notes": "Vergleich zwischen Modellergebnissen und Messwerten\rDer Vergleich zwischen Modellergebnissen und Messwerten kann auf optischer oder auf quantitativer Grundlage erfolgen.\rEin Vergleich auf optischer Grundlage besteht z. B. darin, Grundwassergleichenpläne (modelliert vs. aus Messwerten interpoliert), übereinander zu legen und Abweichungen zu identifizieren.\rBei einem Vergleich auf quantitativer Grundlage wird aus den Abweichungen zwischen Modellgrößen und Messdaten eine Kenngröße errechnet, die ein Maß für die Güte der Modelleichung darstellt.       (Mehr dazu auf der nächsten Seite.)\rKombinieren beider Vorgehensweisen ist möglich und auch zu empfehlen."
    },
    {
        "image": "images/slide_46.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_47.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_48.png",
        "notes": "Quantitativer Vergleich\rGeringe Abweichungen zwischen hmod und hgem resultieren in kleinen Werten für das Gütekriterium (ME, MAE bzw. RMS).\rBei instationärer Modelleichung (fast immer der Fall bei Stofftransport!) sind die Summationen in den obigen Formeln über alle Messstellen und Messzeitpunkte auszuführen."
    },
    {
        "image": "images/slide_49.png",
        "notes": "Gütekriterien\rAbhängig vom verwendeten Gütekriterium erhält man unterschiedliche „optimale“ Parameterwerte. \rME ist nicht brauchbar, da sich immer eine Parameter-kombination finden lässt, so dass ME = 0 wird. Dabei heben sich (u. U. große!) negative und positive Abweichungen gegenseitig auf.\rRMS wird wegen der Analogie zur Berechnung der Standardabweichung einer Zufallsverteilung gegenüber MAE zumeist bevorzugt.\rEs gibt verallgemeinerte Formeln für ME, MAE und RMS mit Gewichtsfaktoren für einzelne Abweichungen."
    },
    {
        "image": "images/slide_50.png",
        "notes": "Gütekriterien\rBeispiele für den qualitativen Vergleich (vermutlich haben Sie dieses Vorgehen (linke Seite der Abb.) auch in Beleg Teil 1 angewendet)"
    },
    {
        "image": "images/slide_51.png",
        "notes": "Gütekriterien\rBeispiele für Scatter plots, welche gemessene und berechnete Modellergebnisse in einem Diagramm darstellen\rStimmen Mess- und Modellwerte überein, liegt der Punkt auf der eingezeichneten 45º Linie"
    },
    {
        "image": "images/slide_52.png",
        "notes": "Beispiel Dover Airbase\rangesprochenes Beispiel aus LV01"
    },
    {
        "image": "images/slide_53.png",
        "notes": "Graphische Darstellung – komplexes Modell mit sehr vielen Beobachtungswerten\rScatterplot (links)\rResidual in Abhängigkeit von der Potentialhöhe (rechts)\rbeide Grafiken geben einen guten Einblick in die Modellgüte"
    },
    {
        "image": "images/slide_54.png",
        "notes": "Graphische Darstellung – komplexes Modell mit sehr vielen Beobachtungswerten\rKartendarstellung der Residuen \rzeigt sehr schön, dass im Aussagegebiet (Zentrum des Modells) die Abweichungen gering sind (kleine Kreise) und an den Modellrändern höhere Abweichungen auftreten (große Kreise)\rDie Farben markieren die Richtung der Abweichung (zu groß/zu Klein)"
    },
    {
        "image": "images/slide_55.png",
        "notes": "Übung Beispiel 2 – hier zur Darstellung der Kalibrierung\rAufgabe/Problem bereits behandelt\rAn dieser Stelle wird die Visualisierung an einem vertrautem Beispiel gezeigt"
    },
    {
        "image": "images/slide_56.png",
        "notes": "Übung Beispiel 2 – hier zur Darstellung der Kalibrierung\rgrafische Darstellung berechnet / gemessen"
    },
    {
        "image": "images/slide_57.png",
        "notes": "Übung Beispiel 2 – hier zur Darstellung der Kalibrierung\rBerechnung der statistischen Zahlen\rDas Beispiel zeigt, wie sich die einzelnen Größen (für das selbe Resultat) unterscheiden"
    },
    {
        "image": "images/slide_58.png",
        "notes": "Übung Beispiel 2 – hier zur Darstellung der Kalibrierung\rScatterplot und Abweichung (Residual) der einzelnen Beobachtungen"
    },
    {
        "image": "images/slide_59.png",
        "notes": "Übungsaufgabe\rgegeben sind gemessene und numerisch berechnete Werte für ein Einzugsgebiet (folgende Folie)\rgesucht ist\rdie Berechnung der einzelnen stat. Größen\rScatterdiagramm\roptimales Vorgehen\rmittels Tabellenkalkulation (XLS-Sheet) oder \rpassendes Jupyter-Notebook\rfür die eigene Anwendung in Beleg Teil 2 steht ein Jupyter Notebook zur Verfügung (Vorstellung in LV 12 am 13. Januar 2022)"
    },
    {
        "image": "images/slide_60.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_61.png",
        "notes": "Einzugsgebiet zu den gemessenen Daten"
    },
    {
        "image": "images/slide_62.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_63.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_64.png",
        "notes": "Zwischenfazit\rpraktische ‘Stolperstellen’ angesprochen (ungeeignete Beobachtungswerte usw.)"
    },
    {
        "image": "images/slide_65.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_66.png",
        "notes": "Parameteranpassung\rDie Parameteranpassung erfolgt zumeist noch von Hand (manuelle Kalibrierung).\rDie Änderung der Parameterwerte bzw. der Zonenbegrenzungen ist eine „Reaktion“ auf die festgestellten Abweichungen zwischen Modellergebnissen und Messdaten.\rZiel ist die Verringerung großer und die Beibehaltung kleiner Abweichungen.\rDie Parameteranpassung setzt standortspezifische und allgemeine (geohydraulische) Kenntnisse voraus.\rWichtige Grundregeln:\rIn jedem Kalibrierschritt sollte nur ein Parameterwert oder nur eine \tZonenbegrenzung geändert werden.\rAuswirkungen der Änderung aufs Ergebnis (inkl. Gütekriterium) sind nachvollziehbar zu dokumentieren. (Das gilt auch für Fehlschläge!)\rEffiziente Alternative zum manuellen Kalibrieren: automatische Kalibrierung!\rAusblick auf den folgenden Folien\rweitere Informationen in LV"
    },
    {
        "image": "images/slide_67.png",
        "notes": "Beispiel am Computer 1\rAufbau des Modells in OPAL dokumentiert\rVorhandenes Modell ebenfalls in OPAL zu finden\rbei der Anpassung können die einzelnen Parameter variiert werden\rK-Werte der Zonen\rweitere Parameter sind in dieser Aufgabe nicht vorgesehen (theoretisch denkbar wären u. a. GWN, Leitwert Fluss)"
    },
    {
        "image": "images/slide_68.png",
        "notes": "Beispiel am Computer 2 (aus Anderson et al. 2015)\rAufbau des Modells eigenständig mit MODELMUSE möglich\rauf Basis des Beispiels sind Jupyter Notebooks vorhanden (https://github.com/Applied-Groundwater-Modeling-2nd-Ed/Chapter_9_and_10_problems)\rangepasste / vereinfachte Notebooks stehen zur Verfügung"
    },
    {
        "image": "images/slide_69.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_70.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_71.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_72.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_73.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_74.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_75.png",
        "notes": "Manuelle Kalibrierung\rmanuelle Kalibrierung (u. a. angewendet im Beleg Teil 2) ist das traditionelle ‘Mittel der Wahl’\rDie Folie führt einige Nachteile der manuellen Kalibrierung auf"
    },
    {
        "image": "images/slide_76.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_77.png",
        "notes": "Ausblick automatische Kalibrierung\rDie Folie zeigt Ausschnitte aus einem Report, der die automatische (Neu)Kalibrierung eines vorhandenen regionalen Strömungsmodells dokumentiert\rDas Modell ist räumlich sehr weit gefasst (siehe Abb. linke Seite)\rDas Modell umfasst eine Vielzahl von Parametern (siehe Abb. Mitte)\rDie Neukalibrierung benötigt hohe Rechenleistung (siehe Abb. rechte Seite – Cluster für die Berechnung)\rWeitere Informationen https://www.twdb.texas.gov/publications/reports/contracted_reports/doc/0804830820_Edwards-Trinity_PecosGAM.pdf\rVorläufiges Fazit an dieser Stelle: Die automatische Kalibrierung bringt viele Vorteile, bedingt aber auch einen hohen techn. Aufwand"
    },
    {
        "image": "images/slide_78.png",
        "notes": "Erläuterung\rDie Zielfunktion ist hier als Summe der quadratischen Residuen (d. h. Abweichung gemessen – berechnet) dargestellt; die Zielfunktion könnte auch eine andere stat. Kenngröße wie RMS, ME, MAE sein\rEbenso ist hier ein Fall für ein Modell mit (nur) zwei Kalibrierparametern p1 und p2 dargestellt\res wird deutlich, dass mehrere Parameterkombinationen zu einer gleichen Modellgüte führen\rWichtig: Dieses Verhalten der Zielfunktion als Funktion der Modellparameter ist üblicherweise nicht direkt bekannt"
    },
    {
        "image": "images/slide_79.png",
        "notes": "Interpretation des Verhalten\rdas hier dargestellte Verhalten zeigt eine sehr ausgeprägte Korrelation zwischen p1 und p2\rd. h. das richtige Verhältnis von p1 / p2 führt zur Minimierung der Zielfunktion (z. B. kleines p1 und p2 oder großes p1 und p2)"
    },
    {
        "image": "images/slide_80.png",
        "notes": "Eigene Anwendung / Beispiel: Lumped Parameter Modell für ein Einzugsgebiet\r‘allgemeines’ Modell für das Verhalten eines Einzugsgebietes\rdas Einzugsgebiet wird als ein Volumen betrachtet, dass mit der Höhe h gefüllt ist\rAblauf geschieht über einen Leitwert K als Funktion des Füllstandes h\rZustrom über Recharge R\rSpeicher wird mittels S bescrieben\rLösung des Modells mittels analytischer Lösung möglich (siehe Storage.xls im OPAL-Kurs bzw. https://mybinder.org/v2/gh/ThoReimann/HydroTeaching/master"
    },
    {
        "image": "images/slide_81.png",
        "notes": "Ergebnisse (Studierende seit 2014)\rGrundannahme: alles Kalibrieren nach bestem Wissen und Gewissen:\rgroßes Spektrum an verschiedenen Werten"
    },
    {
        "image": "images/slide_82.png",
        "notes": "Auswertung der (stud.) Ergebnisse\robere Abbildung: direkte Korrelation nicht offensichtlich\runtere Abbildungen: hier sind die Parameter logarithmisch aufgetragen – hier wird die direkte Korrelation offensichtlich\rFazit: aufgrund der direkten Korrelation wird das Modell durch Parameterkombinationen (K / S etc.) kalibriert; die einzelnen Parameterwerte können nicht eindeutig bestimmt werden (das wäre möglich, wenn z. B. ein Parameter bekannt / gemessen ist)\reine Automatische Kalibrierung kann diese (im Beispiel zu Beginn nicht offensichtliche) Korrelation ausweisen"
    },
    {
        "image": "images/slide_83.png",
        "notes": "Erläuterung\rDie Zielfunktion ist hier als Summe der quadratischen Residuen (d. h. Abweichung gemessen – berechnet) dargestellt; die Zielfunktion könnte auch eine andere stat. Kenngröße wie RMS, ME, MAE sein\rEbenso ist hier ein Fall für ein Modell mit (nur) zwei Kalibrierparametern p1 und p2 dargestellt\res wird deutlich, dass mehrere Parameterkombinationen zu einer gleichen Modellgüte führen\rWichtig: Dieses Verhalten der Zielfunktion als Funktion der Modellparameter ist üblicherweise nicht direkt bekannt"
    },
    {
        "image": "images/slide_84.png",
        "notes": "Hohe Korrelation\rweitere Darstellung: deutlich wird, dass ein Spektum des Parameterwertes die Zielfunktion minimiert"
    },
    {
        "image": "images/slide_85.png",
        "notes": "Parameterunsicherheit\raus dem beschriebenen Verhalten resultiert die Parameterunsicherheit, d. h. bei Parametern, die stark korrelieren, ergibt sich eine hohe Schwankungsbreite des Parameters (ein Bereich des Parameters, der das Modell ähnlich gut kalibriert)"
    },
    {
        "image": "images/slide_86.png",
        "notes": "praktische automatische Kalibrierung\rin der praktischen Anwendung haben die Modelle (viel) mehr als zwei Parameter\rim Beleg Teil 2 z. B. ca. 25+ (hydr. Leitfähigkeiten in den verschiedenen Zonen, Grundwasserneubildung in den verschiedenen Zonen etc.)\rDas Verhalten der Zielfunktion als Funktion der einzelnen Parameter ist äußerst komplex und steht im Fokus bei der automatischen Kalibrierung"
    },
    {
        "image": "images/slide_87.png",
        "notes": "Wege zur Lösung\rdie Algorithmen zur automatischen Kalibrierung berechnen üblicherweise die Jacobian-Matrix, welche die Abweichung der einzelnen Beobachtungspunkte (o …observation) von der Änderung der Parameter (p … parameter) beschreibt\rjeder Modellparameter resultiert dabei in einer Spalte der Jacobian Matrix"
    },
    {
        "image": "images/slide_88.png",
        "notes": "Wege zur Lösung\rdamit resultiert jeder Kalibrierparameter in min. einem Modelllauf, um die Jacobian-Matrix zu berechnen (d. h.  wenn das Modell 100 Parameter aufweist, sind +100 Modellläufe nötig, um die Jacobian-Matrrix zu berechnen)"
    },
    {
        "image": "images/slide_89.png",
        "notes": "Ausblick automatische Kalibrierung\rDie Folie zeigt Ausschnitte aus einem Report, der die automatische (Neu)Kalibrierung eines vorhandenen regionalen Strömungsmodells dokumentiert\rDas Modell ist räumlich sehr weit gefasst (siehe Abb. linke Seite)\rDas Modell umfasst eine Vielzahl von Parametern (siehe Abb. Mitte)\rDie Neukalibrierung benötigt hohe Rechenleistung (siehe Abb. rechte Seite – Cluster für die Berechnung)\rWeitere Informationen https://www.twdb.texas.gov/publications/reports/contracted_reports/doc/0804830820_Edwards-Trinity_PecosGAM.pdf\rVorläufiges Fazit an dieser Stelle: Die automatische Kalibrierung bringt viele Vorteile, bedingt aber auch einen hohen techn. Aufwand"
    },
    {
        "image": "images/slide_90.png",
        "notes": "In den nachfolgenden Folien weitere Anmerkungen zu den theoretischen Hintergründen der automatischen Kalibrierung\r\rGrundlagen\rAutomatische Modelleichung bedeutet, dass die Minimierung von MAE oder (meistens) RMS von einem Computerprogramm übernommen wird.\rBeispiel: PEST (Parameter ESTimation)\rDie automatische Modelleichung ist auf die Bestimmung von Parameterwerten beschränkt, d. h. die Zonierung muss fest vorgegeben werden.\rComputerprogramme zur automatischen Modelleichung verwenden Grundlagen und Algorithmen der Nichtlinearen Optimierung."
    },
    {
        "image": "images/slide_91.png",
        "notes": "Wege zur Lösung\rDie Abbildung zeigt symbolisch das Vorgehen eines Algorithmus zur automatischen Kalibrierung\rjeder grüne Pfeil repräsentiert einen Optimierungsschritt\rfür jeden Optimierungsschritt muss die Jacobian-Matrix berechnet werden\rd. h. bei einem Modell mit 100 Kalibrierparametern und 10 Otimierungsschritten sind +1000 Modelläufe für einen automatische Kalibrierung nötig (angenommen, ein Modelllauf = 1 Minute wären das ca. 17 Stunden Rechenzeit)"
    },
    {
        "image": "images/slide_92.png",
        "notes": "Beispiel mit zwei Kalibrierparametern\ranalog dem Vorgehen auf der vorherigen Folie\rEin Optimierungsschritt / Iterationsschritt entspricht einem grünen Pfeil auf der vorigen Folie"
    },
    {
        "image": "images/slide_93.png",
        "notes": "Vor- und Nachteil der automatischen Kalibrierung\rdie automatische Kalibrierung benötigt etwas mehr Aufwand beim Modelllaufbau und einiges Wissen, um die Ergebnisse zu interpretieren\rüblicherweise überwiegt der Nutzen bei weitem den Aufwand (Hinweis: in MODELMUSE ist die Schnittstelle zu gängiger Software zur automatischen Kalibrierung vorhanden (UCODE / MODELMATE) bzw. folgt zeitnah (PEST – im Moment kurz vor Veröffentlichung in MODELMUSE)\rpraktische Anwendung im Rahmen des Moduls Fallstudien der Grundwasserbewirtschaftung im Sommersemester"
    },
    {
        "image": "images/slide_94.png",
        "notes": "Einstimmung automatische Kalibrierung\rBei der automatischen Kalibrierung variiert eine Software die Kalibrierparameter\rDer Erfolg der Parametervariation wird anhand einer Zielfunktion (mittlere quadratische Abweichung, gewichtet für die einzelnen Messungen) bewertet\rDie Abbildung zeigt, an welchen Stellen im Ablauf\rder Aufwand steigt (Setup Modell, u. a. um die Stabilität und die Effizienz zu optimieren)\rder Aufwand sinkt (Kalibrierprozess – hier kann die Zeiteinsparung sehr hoch werden)"
    },
    {
        "image": "images/slide_95.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_96.png",
        "notes": "Schwierigkeiten bei der automatischen Kalibrierung (Mehrdeutigkeit – mehrere Minima)\rSuchalgorithmen sind mit einem einzigen Suchlauf nicht in der Lage, die Mehrdeutigkeit festzustellen.\rVerwendung unterschiedlicher Startwerte bei der Suche nach der „optimalen“ Parameter-kombination wird empfohlen."
    },
    {
        "image": "images/slide_97.png",
        "notes": "Schwierigkeiten bei der automatischen Kalibrierung (lokale vs. globale Minima)\rSuchalgorithmus kann in einem einzigen Suchlauf nicht erkennen, ob ein lokales oder das globale Minimum gefunden wurde.\rWiederum ist die Verwendung unterschiedlicher Startwerte sinnvoll."
    },
    {
        "image": "images/slide_98.png",
        "notes": "Schwierigkeiten bei der automatischen Kalibrierung\rgeringe Änderungen von RMS über einen großen Parameterbereich\rSuchalgorithmus hat Schwierigkeiten, die genaue Lage des Minimums zu lokalisieren.\rDurch die Verschärfung der Abbruchbedingung (für die Modellkalibrierung!) ist bis zu einem gewissen Grad Abhilfe möglich."
    },
    {
        "image": "images/slide_99.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_100.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_101.png",
        "notes": "Überblick und einführendes Beispiel\rIm Vergleich zur Kalibrierung eines stationären Strömungsmodells treten weitere (mögliche) Kalibrierparameter auf: Speicherkoeffizient, Anfangswerte\rStatt einzelner Werte sind Zeitreihen bzw. Ganglinien zu vergleichen.\rDie Summation zur Berechnung von MAE oder RMS umfasst alle Messzeitpunkte und alle Messstellen.\rAbbildung in der Folie: Beispiel für ein instationäres Modell mit (u. a.) Grundwaserneubildung (Recharge R) als Kalbrierparameter."
    },
    {
        "image": "images/slide_102.png",
        "notes": "Grundsätzliches Vorgehen\r1. Schritt: stationäre Modelleichung\r2. Schritt: instationäre Modelleichung\rVoraussetzung für die Durchführbarkeit dieser Vorgehensweise ist die Verfügbarkeit entsprechender Daten (Messwerte für stationäre Bedingungen sowie Zeitreihen für instationäre Bedingungen). Ebenso muss das numerische Modell einen stationären Zustand erlauben (stabile und konvergente Lösung; konzeptionelles Modell muss stationären Zustand erlauben – dies ist z. B. bei der Wasserentahme durch Brunnen ohne Zufluss durch speisende Randbedingungen nicht der Fall)\rKalibrierparameter, die bei der stationären Kalibrierung bestimmt worden und nicht zeitabhängig sind (z. B. hydraulische Leitfähigkeit), bleiben während der instationären Kalibrierung unverändert.\rDie Aufteilung in zwei Schritte (sofern möglich!) reduziert die Anzahl an Kalibrierparametern für jeden Einzelschritt und erleichtert so das Vorgehen bei der Kalibrierung von Strömungsmodellen.\rDa Stoffausbreitungsvorgänge i. d. R. instationär ablaufen, wird für Stofftransportmodelle eine instationäre Kalibrierung durchgeführt. \rDie Kalibrierung eines Stofftransportmodells erfolgt üblicherweise, nachdem die Kalibrierung des zugehörigen Strömungsmodells abgeschlossen ist. (Manchmal kann jedoch eine Neukalibrierung des Strömungsmodells erforderlich werden!)"
    },
    {
        "image": "images/slide_103.png",
        "notes": "Anfangswerte bei instationärer ModellKalibrierung\rDie Vorwärtsmodellierung bei der instationären Modellkalibrierung erfordert die Vorgabe von Anfangswerten der Potentialhöhe in jeder Modellzelle.\rAus den verfügbaren Zeitreihen sind jedoch nur die Anfangswerte an einzelnen Messpunkten bekannt.\rAnfangswerte für die anderen Modellzellen müssen anderweitig bestimmt werden.\rSchlechte Abschätzungen für Anfangswerte wirken sich auf die Qualität der Modellanpassung negativ aus.\r2 Möglichkeiten:\rstationären Zustand als Anfangswerte wählen\r“dynamic water balance“ (d. h. Einschwingen von einem stabilem Startzustand)\r\rStationärer Anfangszustand\rIdentifikation eines stationären Zustands in den verfügbaren Ganglinien (im Beispiel: „4/88“) (aber typ. Frage bei der praktischen Anwendung: welche Daten repräsentieren einen stationären / mittleren Zustand?)\rstationäre Potentialhöhen für alle Modellzellen bestimmen \rDieser stationäre Zustand bildet die Anfangsbedingung für sämtliche Vorwärtssimulationen bei der instationären Modellkalibrierung.\rNachteil: Methode ist nicht anwendbar, wenn der Messzeitraum keinen stationären Zustand enthält."
    },
    {
        "image": "images/slide_104.png",
        "notes": "Stationäre / Instationäre Kalibrierung\rAbbildung zeigt verschiedene Größen an einer Grundwassermessstelle\rim Falle einer stationären Modellierung muss entschieden werden, welcher Wert verwendet wird (repräsentativ für den stat. Zustand)"
    },
    {
        "image": "images/slide_105.png",
        "notes": "Beispiel instationäre Kalibrierung (I)\rIn diesem Beispiel wurde der Mittelwert der Periode 1990-2000 als repräsentativ für das stationäre Modell gewählt"
    },
    {
        "image": "images/slide_106.png",
        "notes": "Beispiel instationäre Kalibrierung (II)\rDargestellt sind die Potentialhöhen einer Messstelle des Edwards-Trinity-Aquifersystems in den USA (https://www.twdb.texas.gov/groundwater/aquifer/majors/edwards-trinity-plateau.asp),\rVerkarsteter Grundwasserleiter,\rDer Aquifer ist durch ein ‘Leerlaufverhalten’ gekennzeichnet, d. h. Niederschläge ‘füllen’ den Grundwasserleiter auf, der anschließend leerläuft,\rDer Zustand bei Leerlaufen (ähnlich ‘Basisabfluss’) wird hier als repräsentativ für den stationären Zustand betrachtet."
    },
    {
        "image": "images/slide_107.png",
        "notes": "Dynamic water balance\rSimulationsbeginn liegt weit vor dem Vergleichszeitraum.\rAnfangsbedingung ist für die Modellzellen ohne Messstelle eine (grobe) Abschätzung.\rRandbedingungen aus dem Vergleichszeitraum werden ab Simulationsbeginn periodisch wiederholt.\rWährend der Einschwingphase wird der Einfluss der Anfangswerte auf die Modellergebnisse immer unbedeutender.\rVergleich zwischen Modellergebnissen und Messreihen erfolgt nur im Vergleichszeitraum.  \r\rNachteil:\rManche Grundwasserleiter besitzen ein „gutes Gedächtnis“, d. h. der Einfluss der Anfangswerte wird nur langsam gedämpft.\rDies bedeutet eine lange Einschwingphase und somit einen hohen Rechenzeitbedarf.\rIn Extremfällen beträgt der Vergleichszeitraum nur 1 % der gesamten Simulationsdauer."
    },
    {
        "image": "images/slide_108.png",
        "notes": "Beispiel (Demonstration / Quiz)\rEinfluss der verschiedenen Parameter und Randbedingungen auf die dynamische Reaktion des Druckpotentials"
    },
    {
        "image": "images/slide_109.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_110.png",
        "notes": "Grundlagen\rSensitivitätsanalyse = Quantifizierung des Zusammenhangs zwischen Modelleingangsgrößen (z. B. hydraulische Leitfähigkeit, GWN, Dispersivitäten) und Modellergebnissen (z. B. Potentialhöhen, Konzentrationen).\rDas (bekannte) Beispiel der Grabenanströmung aus den Veranstaltungen V02/03 ist ein Beispiel für eine (intuitive) Sensitivitätsanalyse, d. h. durch das ‘drehen’ an den Eingangsgrößen GWN und K kann eine unterschiedlich ausgeprägte Reaktion der Potentialhöhen beobachtet werden (https://mybinder.org/v2/gh/ThoReimann/HydroTeaching/master)\rDazu werden die Modelleingangsgrößen einzeln innerhalb sinnvoller Bandbreiten variiert. Ausgangspunkt (Referenzwert) ist bei Kalibirierparametern üblicherweise das jeweilige Ergebnis der Modelleichung.\rVariationen der Modelleingangsgrößen bewirken Änderungen der Modellergebnisse. Die Größe dieser Änderung ist ein Maß für die Sensitivität von Modellergebnissen bezogen auf Änderungen eines Modellparameters.\rSensitivitätsanalysen können sowohl in Verbindung mit der Modellkalibrierung als auch mit der Modellprognose durchgeführt werden."
    },
    {
        "image": "images/slide_111.png",
        "notes": "Sensitivitätskoeffizienten\rAnalog lassen sich prozentuale Sensitivitätskoeffizienten definieren.\rBerechnungen von Sensitivitätskoeffizienten erfolgen bei numerischer Modellierung näherungsweise, da die exakte Auswertung der partiellen Ableitungen nicht möglich ist."
    },
    {
        "image": "images/slide_112.png",
        "notes": "Beispiele\rDie Abbildungen zeigen Möglichkeiten, wie die Sensitivität visualisiert werden kann\rz. B. zeigt die linke Abbildung die prozentuale Änderung von Eingangsgrößen (Grundwasserneubildung und hydraulische Leitfähigkeit) und deren Einfluss die berechneten Potentialhöhen"
    },
    {
        "image": "images/slide_113.png",
        "notes": "Beispiele\rDarstellung der räumlichen Variation (Abweichung des Wasserspiegels entlang der Spalten / Columns eines Finite-Differenzen-Modells)\runterschiedliche Symbole repräsentieren unterschiedliche Änderungen der Modellparameter / Randbedingungen (hier z. B. GWN x 1.5; K x 1.5 usw.)"
    },
    {
        "image": "images/slide_114.png",
        "notes": "Beispiele\rDarstellung der Wasserspiegeländerung in Abhängigkeit von der prozentualen Änderung des Parameters / der Randbedingung"
    },
    {
        "image": "images/slide_115.png",
        "notes": "Beispiel\rdargestellt ist die Sensitivität für einen spezifischen Punkte (Node 16 / 25) und für verschiedene Zeitpunkte"
    },
    {
        "image": "images/slide_116.png",
        "notes": "Beispiel\rzunehmende Komplexität / Vielzahl von Parametern"
    },
    {
        "image": "images/slide_117.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_118.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_119.png",
        "notes": "Zum Begriff\rursprünglich war der Begriff Validierung gebräuchlich\rder Begriff Validierung wird im Praxisumfeld auch noch häufig verwendet\rAllerdings kann der Begriff Validierung irreführend sein, da er sprachlich eine ‘Gültigkeit / Wahrheit’ impliziert, die durch Modelle nicht realisiert werden kann\rdaher wird vorgeschlagen, den Begriff ‘Evaluierung’ zu verwenden"
    },
    {
        "image": "images/slide_120.png",
        "notes": "Dieser Schritt der Modellierung wird manchmal auch als Modellverifizierung bezeichnet.\rUnter Modellverifizierung wird allerdings i. a. der Vergleich einer numerischen Lösung mit einer exakten (analytischen) Lösung verstanden.\rDabei wird ausschließlich das numerische Lösungsverfahren getestet. Ein Vergleich mit Messdaten findet nicht statt, d. h. es lässt sich hieraus auch keine Aussage über die Qualität eines standortspezifischen Modells ableiten."
    },
    {
        "image": "images/slide_121.png",
        "notes": "Modellevaluierung\rDie Modellevaluierung wird nach der (erfolgreichen) Kalibrierung durchgeführt.\rVoraussetzung ist das Vorhandensein zusätzlicher Messdaten, die nicht für die Eichung verwendet wurden.\rFür die entsprechende hydraulische Situation (Anfangs-, Randbedingungen) wird eine Vorwärtssimulation durchgeführt. \r\rFalls der Vergleich zwischen Modellergebnissen und zusätzlichen Messwerten nicht zufriedenstellend ausfällt, dann ist davon auszugehen, dass die bei der Eichung erhaltenen Parameterwerte bzw. Zonierungen das Grundwasserströmungs- bzw. Stofftransportsystem nicht adäquat repräsentieren.\rIn diesem Fall ist die Modellkalibrierung erneut durchzuführen, wobei die zusätzlichen Messwerte ganz oder zumindest teilweise mit einbezogen werden. Damit wird die Eichung auf eine breitere Datenbasis gestellt.\rGleichzeitig stehen dann aber weniger (keine) zusätzliche(n) Messwerte für die Modellevaluierung zur Verfügung!\rVerbesserungen bei der Modelleichung reduzieren (eliminieren) die Datenbasis für die Modellevaluierung (= keine doppelte Verwendung der Messdaten!).  \r\rDas Modell ist evaluiert, wenn die Abweichungen der Modellergebnisse von den zusätzlichen Messdaten akzeptabel sind.\rIn diesem Fall kann man annehmen, dass das Modell prognosefähig ist und zukünftige Szenarien zuverlässig simuliert werden können.\rGrund für diese Annahme: Modell beinhaltet keine In-formationen über die zusätzlichen Messwerte."
    },
    {
        "image": "images/slide_122.png",
        "notes": "Grundlagen\rModellprognose = Simulation zukünftiger (geplanter) Szenarien\rDamit erfolgt eine „Extrapolation“ der gegenwärtigen Situation auf mögliche zukünftige Konstellationen.\rModelle werden hierbei als Planungsinstrumente eingesetzt. Das ist der eigentliche Hauptzweck von Computermodellen (nicht nur) im Grundwasserbereich. Bestmögliche Eichung und Evaluierung sind daher essenziell."
    },
    {
        "image": "images/slide_123.png",
        "notes": "Einführende Erläuterungen zur Unsicherheit\rDas System ist aus den bisherigen LV vertraut (Grabenanströmung), s. LV 02 bzw. auch https://mybinder.org/v2/gh/ThoReimann/HydroTeaching/master -> MWW01/MWW01_T02...\rZufluss hier über Grundwasserneubildung\rAbfluss über definiertes Potential\rals Funktion von Zufluss und hydraulischen Eigenschaften (K-Wert) stellt sich Druckpotential ein\rMessung Druckpotential (= Wasserstand) mittels Messstelle\rSystem ist nicht eindeutig, da …[n. Folie]"
    },
    {
        "image": "images/slide_124.png",
        "notes": "Mehrdeutigkeit\rSteigende Grundwasserneubildung kann durch einen reduzierten hydraulischen Widerstand K kompensiert werden (d. h. ein größerer K-Wert), wobei sich das Druckpotential nicht ändern muss\rEs ändert sich der Abfluss in die Randbedingung, dieser wird aber (typischerweise) nicht überwacht\rdieses Verständnis ist wichtig, da die GWN zusammen mit der hydraulischen LF Kalibrierparameter sind\rKonsequenz: GWN möglichst gut bestimmen (‘messen’) bzw. die Unsicherheiten im Bezug auf GWN-Daten kennen"
    },
    {
        "image": "images/slide_125.png",
        "notes": "Vorhersageunsicherheiten treten auf, wenn (z. B.)\rdie Werte von Kalbrierparametern für zukünftige Szenarien nicht adäquat sind,\rsich Einflussgrößen (z. B. Randbedingungen wie Pumpraten oder GWN) im Vorhersagezeitraum unerwartet ändern. \rGrundsätzlich steigt die Vorhersageunsicherheit (bzw. sinkt die Prognosequalität) mit wachsendem Prognosezeitraum.\r(Grobe) Faustregel aus Anderson & Woessner (1992): Der Prognosezeitraum soll höchstens doppelt so groß sein wie der Kalibrierzeitraum.\rWegen möglicher Prognoseunsicherheiten ist es empfehlenswert, Modellvorhersagen nicht nur für ein einziges Szenario durchzuführen. Vielmehr sollten weitere, sinnvolle Alternativen geprüft werden.\rDiese Vorgehensweise gehört in den Bereich der Sensitivitätsanalysen."
    },
    {
        "image": "images/slide_126.png",
        "notes": "Allgemeine Hinweise - Präsentation\rhäufige Auftraggeber: Behörden, Wasserversorger\rverständliche und überzeugende Darstellung der Ergebnisse\rHilfreich sind dabei übersichtliche und aussagekräftige grafische Darstellungen und / oder Tabellen.\rVoraussetzung ist eine gute Dokumentation aller Modellierungsschritte (vgl. nebenstehendes Ablaufschema). \rDazu gehört auch die Dokumentation von Fehlschlägen – natürlich nur für interne Zwecke!"
    },
    {
        "image": "images/slide_127.png",
        "notes": "Hinweis zu Literatur\rdas Manuskript finden Sie im OPAL Ordner\rsehr verständlich und hilfreich (u. a. gute Vorlage für eine Gliederung)"
    },
    {
        "image": "images/slide_128.png",
        "notes": "Hinweis zur Literatur\rAustralian groundwater modelling guidelines\rfrei verfügbares ‘Buch’ mit vielen Hilfreichen Beispielen"
    },
    {
        "image": "images/slide_129.png",
        "notes": "Grundlagen\rPostaudit = Überprüfung von Modellprognosen während bzw. nach Ablauf des Prognosezeitraums\rBei einem Postaudit handelt es sich demnach um eine A-posteriori-Beurteilung des Prognosefähigkeit des Modells (im Gegensatz zur A-priori-Beurteilung durch die Modell-evaluierung).\rVoraussetzung ist die Verfügbarkeit der Modellergebnisse ggf. auch noch nach Ablauf des Prognosezeitraums, also u. U. Jahrzehnte nach der Modellerstellung."
    },
    {
        "image": "images/slide_130.png",
        "notes": "Zusammenfassung Post-Audits\rIn der Grundwasserliteratur sind laut Anderson und Woessner (1992) nur wenige Postaudits bekannt.\rDies deutet darauf hin, dass Modelle oft nur im Planungsstadium eingesetzt werden. Seltener ist ein Begleiten von Maßnahmen der Grundwasserbewirtschaftung durch Modelle (und noch seltener eine spätere Überprüfung).\rDer Aufwand bei der Modellpflege (Berücksichtigung neuer Daten, Simulation neuer Szenarien, Anpassung an neue Hard- oder Software) wird oft-mals nicht betrieben.\rAlle bekannten Postaudits ergaben erhebliche Schwächen in den Modellprognosen.\rGründe waren entweder ein ungeeignetes konzeptionelles Modell oder unerwartete Änderungen von Modelleingangsparametern während des Prognosezeitraums.\rFür die Qualität des konzeptionellen Modells ist die Modelliererin / der Modellierer verantwortlich.\rUnerwartete Änderungen von Modelleingangsparametern können ihr / ihm nicht angelastet werden.\rVorsichtshalber wird man jedoch nicht nur eine einzige Prognoserechnung durchführen, sondern auch sinnvolle Alternativen simulieren."
    },
    {
        "image": "images/slide_131.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_132.png",
        "notes": "Beispiel für Postaudits\rKalibrierzeitraum: 1930 – 1965\rPrognosezeitraum: 1966 – 1975\rPostaudit 1986\rDie Modellprognose von 1965 lieferte zu kleine Grundwasserstände (gestrichelte Kurve in der oberen Abbildung).\rSie beruhte auf der Annahme hoher Entnahmeraten für Bewässerungszwecke (gestrichelte Kurve in der unteren Abbildung).\rTatsächlich konnte die Entnahmemenge im Prognosezeitraum verringert werden, sodass die Grundwasserstände anstiegen."
    },
    {
        "image": "images/slide_133.png",
        "notes": "Beispiel Postaudits II\rDas diesem Beispiel zugrundeliegende Stofftransportmodell prognostizierte eine Zunahme der Salinität für den Zeitraum von 1973 bis 1982.\rDiese Prognose basierte nur auf Messwerten von 1971 und 1972!\r1966 – 1971 war im Untersuchungsgebiet ein überdurchschnittlich feuchter Zeitraum, d. h. die Salinität lag unter dem Durchschnitt.\rDies wurde bei der Modellkalibrierung nicht berücksichtigt.\rDas Postaudit ergab, dass eine zuverlässige Prognose mit einer vierjährigen Datenbasis (1971 – 1974) möglich gewesen wäre."
    },
    {
        "image": "images/slide_134.png",
        "notes": "Beispiel Postaudit\rStofftransport in Kluftgestein (Basalt)\rModellerstellung 1974\rKalibrierzeitraum: 1958 – 1969\rPrognose für 1980\rKalibrierergebnis: Querdispersivität > Längsdispersivität\rDamit wird offenbar irgendein Effekt fälschlicherweise als Dispersion abgebildet.\rErgebnis des Postaudits: Das Modell prognostizierte eine zu schnelle Stoffausbreitung.\rHauptproblem: zu stark vereinfachtes konzeptionelles Modell\rSo wurde hier ein Kontinuummodell verwendet, d. h. die Klüfte wurden im Modell nicht explizit berücksichtigt."
    },
    {
        "image": "images/slide_135.png",
        "notes": "No notes"
    }
]