[
    {
        "image": "images/slide_1.png",
        "notes": "Willkommen zur Grundwasserbewirtschaftung mit Computermodellen – Thema 04: Numerische Lösung der Transportgleichung\rNachfolgend die wichtigsten Folien, zum Teil mit Kommentaren (Stand 2022 11 03),\rNeben diesen Folien finden Sie im OPAL-Kurs weitere Materialien, u. a. elektronische Kontrollfragen,\rBei Fragen, Kommentaren und Hinweisen freuen wir uns von Ihnen zu hören."
    },
    {
        "image": "images/slide_2.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_3.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_4.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_5.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_6.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_7.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_8.png",
        "notes": "Begriffe\rKonservative Stoffe (inerte Stoffe, nicht-reaktive Stoffe) sind im Sicker- oder Grundwasser gelöste Stoffe, die während des Transports keinen physikalischen, chemischen oder biologischen Veränderungen unterliegen.\rUnter dem Begriff „konservativer Stofftransport“ werden dementsprechend alle Ausbreitungsprozesse zusammengefasst, die keine physikalischen, chemischen oder biologischen Veränderungen der gelösten Stoffe hervorrufen.\rDazu gehören Advektion (Konvektion), mechanische Dispersion und Porendiffusion.\rReaktive Stoffe unterliegen hingegen physikalischen, chemischen oder biologischen Veränderungen.\rZu den entsprechenden reaktiven Stofftransportprozessen gehören Sorption / Desorption, mikrobieller Abbau, radioaktiver Zerfall, geochemische Reaktionen."
    },
    {
        "image": "images/slide_9.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_10.png",
        "notes": "Transportmodelle für konservativen Stofftransport basieren auf\rdem Massenerhalt innerhalb von Kontrollvolumina (inkl. Zufuhr / Entnahme von Masse z. B. mittels Tracerinjektion oder über GWN)\rFließgesetzen für Advektion und Dispersion über die Grenzflächen benachbarter Kontrollvolumina\r\rn = (totale) Porosität = Wasservolumen / Kontrollvolumen [-]\rne= effektive Porosität= Volumen des mobilen Wassers / Kontrollvolumen [-]\rM = Aquifermächtigkeit [L]\rN = Grundwasserneubildung (GWN) [L/T]\rV = Abstandsgeschwindigkeit [L/T]\rD = Dispersionskoeffizient bzw. –tensor [L²/T]\rC = Stoffkonzentration (gelöst) = gelöste Stoffmasse / Wasservolumen [M/L³]\rC’ = Zugabe- bzw. Entnahmekonzentration (bei Zugabe: C’ ist vorzugeben; bei Entnahme: C’ = C) [M/L³]\rF = Massenfluss (= Stofffracht) [M/T]"
    },
    {
        "image": "images/slide_11.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_12.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_13.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_14.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_15.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_16.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_17.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_18.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_19.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_20.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_21.png",
        "notes": "We can consider solutes in two broad classes: conservative and reactive: \rConservative solutes do not react with the soil and/ or native ground water or undergo biological or radioactive decay. The chloride ion is a good example of a conservative solute.\rReactive transport includes all mechanisms that lead to a non-conservative behavior:\rDecay, degradation, reactions in general\rAdsorption\r\rTransport in groundwater is controlled by a set of different processes (bold those who are considered as conservative)\rDiffusion\rAdvection\rDispersion\rRetardation\rReactions\rDecay"
    },
    {
        "image": "images/slide_22.png",
        "notes": "Transport of parcels on a conveyor belt is comparable of advective transport of solutes (= parcels) with the moving groundwater (conveyor belt)"
    },
    {
        "image": "images/slide_23.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_24.png",
        "notes": "We can consider solutes in two broad classes: conservative and reactive: \rConservative solutes do not react with the soil and/ or native ground water or undergo biological or radioactive decay. The chloride ion is a good example of a conservative solute.\rReactive transport includes all mechanisms that lead to a non-conservative behavior:\rDecay, degradation, reactions in general\rAdsorption\r\rTransport in groundwater is controlled by a set of different processes (bold those who are considered as conservative)\rDiffusion\rAdvection\rDispersion\rRetardation\rReactions\rDecay"
    },
    {
        "image": "images/slide_25.png",
        "notes": "Think about a tracer test and a typical break through curve\rWhy do we get the pronounced tailing even for an (nearly) instantaneous input (check the time axis – shown is one day = 86400 seconds)"
    },
    {
        "image": "images/slide_26.png",
        "notes": "Another conservative transport process is mechanical dispersion\rThe figure shows processes that cause dispersion on the pore scale\r\rSee also http://hydrogeologistswithoutborders.org/wordpress/1979-english/chapter-2/#2.13"
    },
    {
        "image": "images/slide_27.png",
        "notes": "With increasing scale, mechanical dispersion is caused by processes like heterogeneity and geological structures"
    },
    {
        "image": "images/slide_28.png",
        "notes": "Dispersivity is the parameter to describe dispersion\rDispersivity comes with the dimension length [L];\rRule of thumb for an initial assumption: dispersivity approx. 0,1 x transport distance"
    },
    {
        "image": "images/slide_29.png",
        "notes": "These data are based on (field) experiments\rDifferent symbols represent different sediments\rAttention: length scale is logarithmic\rDispersivity is scale dependent (i.e. the dispersivity measured in the lab cannot be transferred to a catchment)"
    },
    {
        "image": "images/slide_30.png",
        "notes": "Di"
    },
    {
        "image": "images/slide_31.png",
        "notes": "Basic principles of diffusion (cause by Brown’s molecule movement)\rImportant to note that Diffusion coefficients in free water are quite small\r\rThe negative sign indicates that the movement is from greater to lesser concentrations. Note the analogies to Darcy's law (hydraulic flow), Ohm's law (charge transport), and Fourier's Law (heat transport)\r\rDiffusion can lead to a spread of a contaminant in absence of a hydraulic gradient, i.e. if the groundwater is not moving, simply due to a concentration gradient (cf. there is no velocity / discharge term in the equation!)\rDiffusion is slow, yet can be significant over long periods of time\rDiffusion can also affect water in voids which are too small to be significant in flow processes “effective porosity” (i.e. in immobile water trapped in small pore radii)"
    },
    {
        "image": "images/slide_32.png",
        "notes": "Concentration profiles of solutes (limited pulse injection) transported by advection and dispersion\rSuggestion: use the Streamlit App for 1D Transport; investigate the effects of varying ne and alpha"
    },
    {
        "image": "images/slide_33.png",
        "notes": "The transport equation: describes advection (blue box), dispersion (red box), sinks and sources (yellow box) and reactions (green box)\rPlease note that this equation accounts for dispersion along flow (longitudinal – DL) and perpendicular to flow (transversal – DT)\rPlease note: so far we didn’t cover reactions (will follow)"
    },
    {
        "image": "images/slide_34.png",
        "notes": "Common solution for the transport equation\rDescribes concentration as function of space and time\rERF and ERFC are the Gaussian error functions / mathematical formulation"
    },
    {
        "image": "images/slide_35.png",
        "notes": "We can consider solutes in two broad classes: conservative and reactive: \rConservative solutes do not react with the soil and/ or native ground water or undergo biological or radioactive decay. The chloride ion is a good example of a conservative solute.\rReactive transport includes all mechanisms that lead to a non-conservative behavior:\rDecay, degradation, reactions in general\rAdsorption\r\rTransport in groundwater is controlled by a set of different processes (bold those who are considered as conservative)\rDiffusion\rAdvection\rDispersion\rRetardation\rReactions\rDecay"
    },
    {
        "image": "images/slide_36.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_37.png",
        "notes": "We can consider solutes in two broad classes: conservative and reactive: \rConservative solutes do not react with the soil and/ or native ground water or undergo biological or radioactive decay. The chloride ion is a good example of a conservative solute.\rReactive transport includes all mechanisms that lead to a non-conservative behavior:\rDecay, degradation, reactions in general\rAdsorption\r\rTransport in groundwater is controlled by a set of different processes (bold those who are considered as conservative)\rDiffusion\rAdvection\rDispersion\rRetardation\rReactions\rDecay"
    },
    {
        "image": "images/slide_38.png",
        "notes": "We can consider solutes in two broad classes: conservative and reactive: \rConservative solutes do not react with the soil and/ or native ground water or undergo biological or radioactive decay. The chloride ion is a good example of a conservative solute.\rReactive transport includes all mechanisms that lead to a non-conservative behavior:\rDecay, degradation, reactions in general\rAdsorption\r\rTransport in groundwater is controlled by a set of different processes (bold those who are considered as conservative)\rDiffusion\rAdvection\rDispersion\rRetardation\rReactions\rDecay"
    },
    {
        "image": "images/slide_39.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_40.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_41.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_42.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_43.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_44.png",
        "notes": "Massenströme\rDie (konservative) Stoffausbreitung in einem Porengrundwasserleiter setzt sich grundsätzlich zusammen aus einer Überlagerung (Superposition) von Advektion, mechanischer Dispersion und Porendiffusion."
    },
    {
        "image": "images/slide_45.png",
        "notes": "Grundideen\rStrömung und Stofftransport können mit zwei Betrachtungsweisen behandelt werden, die auf Euler und Lagrange zurückgehen.\rEuler: Beobachter bzw. Kontrollvolumen in Ruhe\rLagrange: Beobachter bzw. Kontrollvolumen bewegt sich (rein advektiv) mit dem Fluid"
    },
    {
        "image": "images/slide_46.png",
        "notes": "Rein advektive Stoffausbreitung\rIn der Betrachtungsweise nach Lagrange ändert sich bei reiner Advektion die Stoffkonzentration in einem (mit dem Fluid bewegten!) Volumenelement nicht.\rIn der Betrachtungsweise nach Euler ändert sich bei reiner Advektion die Stoffkonzentration in einem (festen!) Volumenelement mit der Zeit.\rMan erhält eine zugehörige Durchbruchskurve, z. B.:"
    },
    {
        "image": "images/slide_47.png",
        "notes": "Überblick\rDie Euler- und die Lagrange-Betrachtungsweise lassen sich erweitern, um Dispersion mit zu berücksichtigen (spätere Vorlesung).\rVerfahren zur Simulation des Stofftransports wurden auf der Basis von beiden Betrachtungsweisen entwickelt.\rBei Euler-Verfahren wird ab und an auch von Euler-Gitterverfahren gesprochen, d. h. mit Hinweis auf das Gitter (= Finite Differenzen / Finite Elemente)"
    },
    {
        "image": "images/slide_48.png",
        "notes": "Probleme von FD Verfahren\rEine zufriedenstellende Simulation der Grundwasserströmung ist zumeist bereits mit einfachen FD-Verfahren möglich.\rDies gilt nicht mehr für die Simulation von Stofftransportvorgängen. Zuverlässige FD-Verfahren sind hier komplizierter aufgebaut.\rDies liegt an den unterschiedlichen Strukturen der Bewegungsgesetze für Advektion und Dispersion, die von ein und demselben Verfahrenstyp nicht mit gleicher Genauigkeit angenähert werden können.\rZuverlässige FD-Verfahren für Stofftransport sind daher aus einer Überlagerung verschiedener Grundtypen gebildet worden, auf die im Einzelnen nicht eingegangen wird.\rDie erwähnten Probleme lassen sich unter die Oberbegriffe „Instabilität“ und „numerische Dispersion“ einordnen.\r\rWeitere Bemerkung:\rDas Arbeitsblatt vom Beginn (Folie 12) gibt bereits einen Einblick in die Problematik ‘Numerische Dispersion’"
    },
    {
        "image": "images/slide_49.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_50.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_51.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_52.png",
        "notes": "Überblick\rDie Euler- und die Lagrange-Betrachtungsweise lassen sich erweitern, um Dispersion mit zu berücksichtigen (spätere Vorlesung).\rVerfahren zur Simulation des Stofftransports wurden auf der Basis von beiden Betrachtungsweisen entwickelt.\rZudem gibt es Mischformen (vgl. Tabelle)."
    },
    {
        "image": "images/slide_53.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_54.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_55.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_56.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_57.png",
        "notes": "Beispiel zur Plausilibität (Trennstromlinie)\rVergleich der numerisch berechneten Varianten mit den Ergebnissen der ‘händisch’ / analytisch berechneten Trennstromlinie (für verschiedene hydr. Leitfähigkeiten)\rd. h. numerische Berechnungen plausible\rDie Berechnung der Trennstromlinie folgt in dieser Lehrveranstaltung"
    },
    {
        "image": "images/slide_58.png",
        "notes": "Einführung\rBahnlinienverfahren („Particle Tracking“) erlauben die Modellierung der advektiven Stoffausbreitung.\rDazu werden (virtuelle) Teilchen oder Partikel an vorgegebenen Punkten ins Strömungsfeld eingesetzt und ihre Bahnen verfolgt.\rAus der Bewegung der Teilchen lassen sich Rückschlüsse über die advektive Stoffausbreitung ziehen (Transportwege und -zeiten).\rModelltechnisch sind dafür Informationen erforderlich über\rdie zeitabhängigen Partikelkoordinaten xp(t) bzw. yp(t),\rdie Abstandsgeschwindigkeit v an der jeweiligen Partikelposition (sowohl x- als auch y-Komponente),\rdie Startzeit eines Partikels (nur bei instationärer Strömung). \r\rPartikel folgen den Stromlinien (Teilchenbahn = Stromlinie). \rDie Stromlinien und damit die Teilchenbahnen liegen tangential zu den Vektoren des Geschwindigkeitsfelds.\rWerden zwei Teilchen zu verschiedenen Zeiten an derselben Stelle in ein stationäres Geschwindigkeitsfeld eingesetzt, so sind ihre Bahnen identisch und für dieselben Transportwege werden dieselben Zeiten benötigt.\rDie Teilchenbahn ist unabhängig vom Startzeitpunkt eines Teilchens."
    },
    {
        "image": "images/slide_59.png",
        "notes": "Instationäre Strömung\rDie Stromlinien liegen tangential zu den Vektoren des (sich zeitlich ändernden!) Geschwindigkeitsfelds.\rTeilchen folgen der „momentanen“ Strömungsrichtung (Teilchenbahn ≠ Stromlinie!). \rWerden zwei Teilchen zu verschiedenen Zeiten an derselben Stelle in ein instationäres Geschwindigkeitsfeld eingesetzt, so sind ihre Bahnen nicht identisch.\rDie Teilchenbahn hängt vom Startzeitpunkt des Teilchens ab."
    },
    {
        "image": "images/slide_60.png",
        "notes": "Bei stationärer Strömung in zwei Raumdimensionen ergeben sich die zeitabhängigen Partikelkoordinaten xp(t) und yp(t) als Lösungen der Bewegungsgleichungen\rDabei sind vx und vy die ortsabhängigen Komponenten der Abstandsgeschwindigkeit.\rDie Bewegungsgleichungen besagen, dass sich die Partikelkoordinaten entsprechend der jeweiligen Komponente der Abstandsgeschwindigkeit ändern.\rDie Lösung der Bewegungsgleichungen erfolgt in den kommerziell erhältlichen Computerprogrammen entweder mit Hilfe eines numerischen Verfahrens oder auf der Basis einer analytischen (Näherungs-)Lösung.\rBeide Methoden benötigen Informationen über die x- und y-Komponente der Abstandsgeschwindigkeit an der Partikelposition.\rDiese Geschwindigkeitsinfo erhält man aus den Ergebnissen des Strömungsmodells."
    },
    {
        "image": "images/slide_61.png",
        "notes": "Das Bahnlinienverfahren von Euler stellt die einfachste numerische Lösung der Bewegungsgleichungen dar. \rDie Auswertung der Komponenten der Abstandsgeschwindigkeit erfolgt dabei jeweils für die Teilchenposition des „alten“ Zeitniveaus.\rÄnderungen der Abstandsgeschwindigkeitskomponenten auf dem Weg des Teilchens werden während des Zeitintervalls Δt nicht berücksichtigt.\rErst für den nächsten Zeitschritt findet wieder ein Update der Abstandsgeschwindigkeit statt."
    },
    {
        "image": "images/slide_62.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_63.png",
        "notes": "Im Gegensatz zum Euler-Verfahren basiert das Bahnlinienverfahren nach Pollock (1988) nicht auf einer numerischen, sondern auf einer analytischen Lösung der Bewegungsgleichungen.\rDabei wird eine spezielle Interpolationsvorschrift für Abstandsgeschwindigkeiten innerhalb jeder Zelle zugrunde gelegt.\rDiese Vorgehensweise ist z. B. in dem Computerprogramm MODPATH realisiert. (MODPATH ist z. B. Teil von ModelMuse.)\rDas Verfahren von Pollock vermeidet die numerischen Fehler des Euler-Verfahrens.\rAufgrund der o. g. Interpolationsvorschrift für die Abstandsgeschwindigkeiten liefert auch das Verfahren von Pollock „nur“ eine Näherungslösung für die Bahnlinien. Der Fehler ist i. a. jedoch erheblich geringer als etwa beim Euler-Verfahren.\rDas Verfahren von Pollock benötigt eine Reihe von Fallunterscheidungen (vgl. nächste Seite)."
    },
    {
        "image": "images/slide_64.png",
        "notes": "In der analytischen Lösung von Pollock ändert sich die Interpolationsformel für die Abstandsgeschwindigkeiten, sobald ein Teilchen während eines Zeitschritts über eine (mehrere) Zellkante(n) verschoben wird.\rDer Zeitschritt ist ggf. entsprechend zu unterteilen.\rFür jeden Abschnitt muss die zugehörige analytische Lösung gesondert ausgewertet werden.\rAnschließend wird der Transport-weg „zusammengestückelt“.\rDie weitgehende Elimination numerischer Fehler wird also durch einen erhöhten Buchhaltungsaufwand bei der Auswertung der analytischen Lösung erkauft."
    },
    {
        "image": "images/slide_65.png",
        "notes": "Diese Methode dient dazu, Fließwege entgegen der Strömungsrichtung zu verfolgen und wird auch als “Backward Tracking“ bezeichnet.\rWie bei der bisher behandelten Variante des Bahnlinienverfahrens (“Forward Tracking“) können auch hier Transportwege und -zeiten bestimmt werden.\r“Backward Tracking“ ist insbesondere für die Ausweisung von Wasserschutzgebieten von Interesse.\rDie Lösung kann mit allen Verfahren erfolgen, die sich für das „Forward Tracking“ eignen.\rLediglich das geänderte Vorzeichen der Abstandsgeschwindigkeit ist zu berücksichtigen."
    },
    {
        "image": "images/slide_66.png",
        "notes": "Partikel bewegen sich entlang der Stromlinien.\r“Backward Tracking“: Bewegung der Partikel ist der Strömungsrichtung entgegengesetzt.\rZusätzlich werden die Laufzeiten entlang der Stromlinien bestimmt.  \rIsochrone = Linie gleicher Laufzeit\rLage der Isochronen ist von der effektiven Porosität ne abhängig.\rVerlauf der Stromlinien ist nicht von der effektiven Porosität ne abhängig."
    },
    {
        "image": "images/slide_67.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_68.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_69.png",
        "notes": "Vorbemerkung\rZiel ist es, einige grundlegende Eigenschaften von Finite-Differenzen-Verfahren (FD-Verfahren) zur numerischen Lösung der Stofftransportgleichung herauszuarbeiten.\rInsbesondere soll dabei auf Probleme von FD-Verfahren eingegangen werden, die bei der Simulation der Grundwasserströmung nicht bzw. nicht so gravierend auftreten.\rDiese Probleme sind letztendlich darauf zurückzuführen, dass die Bewegungsgesetze für Advektion und Dispersion / Diffusion unterschiedliche Struktur aufweisen:\radvektiver Massenstrom ~ Konzentration\rdispersiver/diffusiver Massenstrom ~ Konzentrationsgradient"
    },
    {
        "image": "images/slide_70.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_71.png",
        "notes": "Ursache der Probleme: unterschiedliche Struktur der Bewegungsgesetze für Advektion und Dispersion:\radvektiver Massenstrom ~ Konzentration\rdispersiver Massenstrom ~ Konzentrationsgradient"
    },
    {
        "image": "images/slide_72.png",
        "notes": "FD Verfahren\rDoppelindizierung der Knoten (Zellen) mit (i,j)\rAbkürzung: Cij = C(xi,yj)\rFD-Verfahren hat die Aufgabe, alle Näherungswerte Cij der Stoff-konzentration zu ermitteln."
    },
    {
        "image": "images/slide_73.png",
        "notes": "Diese Gleichung wird auf der folgenden Seite in ein explizites FD-Verfahren übergeführt.\r„Explizit“ bedeutet, dass die Berechnung der neuen Konzentrationswerte (Zeitniveau t + t) unabhängig voneinander durchgeführt werden. Es werden also keine Konzentrationsinfos dieses Zeitniveaus aus den Nachbarzellen berücksichtigt, sondern nur aus dem vorangegangenen Zeitniveau t."
    },
    {
        "image": "images/slide_74.png",
        "notes": "FD explizit (Beispiel)\rVerfahren ist anfällig für Numerische Dispersion \rTrick: Dispersivität  um diesen Betrag verringern (Ergebnis darf aber nicht negativ werden und Trick klappt nicht bei jedem Verfahren!)\rOszillationen (Instabilitäten) treten auf bei negativen Gewichtsfaktoren. Das führt hier zur Zeitschrittbegrenzung:"
    },
    {
        "image": "images/slide_75.png",
        "notes": "Probleme\rEine zufriedenstellende Simulation der Grundwasserströmung ist zumeist bereits mit einfachen FD-Verfahren möglich.\rDies gilt nicht mehr für die Simulation von Stofftransportvorgängen. Zuverlässige FD-Verfahren sind hier komplizierter aufgebaut.\rDies liegt an den unterschiedlichen Strukturen der Bewegungsgesetze für Advektion und Dispersion, die von ein und demselben Verfahrenstyp nicht mit gleicher Genauigkeit angenähert werden können.\rZuverlässige FD-Verfahren für Stofftransport sind daher aus einer Überlagerung verschiedener Grundtypen gebildet worden, auf die im Einzelnen nicht eingegangen wird.\rDie erwähnten Probleme lassen sich unter die Oberbegriffe „Instabilität“ und „numerische Dispersion“ einordnen.\r\rStabilität vs. Instabilität\rStabilität eines FD-Verfahrens ist ein wesentliches Kriterium zur Beurteilung der Qualität des Verfahrens.\rEin FD-Verfahren ist instabil, wenn in den Ergebnissen physikalisch unsinnige Oszillationen auftreten (die sich dann auch noch mit der Zeit verstärken).\rEin FD-Verfahren ist stabil, wenn keine physikalisch unsinnigen Oszillationen auftreten.\rStabilität ist jedoch keine Garantie dafür, dass das FD-Verfahren eine brauchbare Näherungslösung für die Modellgleichung liefert. (Auch nicht oszillierende Lösungen können u. U. ungenau sein!)"
    },
    {
        "image": "images/slide_76.png",
        "notes": "Courant Zahl\rDie Courant-Zahl Co ist das Verhältnis aus der Transportstrecke in einem Zeitschritt Δt zur Schrittweite Δx:\rIn der Abbildung\rsymbolisiert der blaue Pfeil die Transportstrecke\rsymbolisiert der grüne Pfeil die Schrittweite (hier die räumliche Diskretisierung)\rPraktisch bedeutet eine Courantzahl von 1, das die Transportstrecke gleich der Schrittweite ist\rIn der praktischen Anwendung\rkann die Software die nötige Courantzahl z. B. durch die Begrenzung des Zeitschritts t realisieren,\rkann ein Alogithmus bzw. ein Rechenverfahren eine höchstens zulässige Courantzahl bedingen (z. B. in Form eines Stabilitätskriteriums; wird die zulässige Courantzahl überschritten, kann das Rechenverfahren instabil werden; siehe auch vorige Seite: die nötigen ‘Zutaten’ für das FD Verfahren befinden sich in den benachbarten Zellen; um sicherzustellen, dass sich die gelösten Stoffe nicht ausserhalb der ‘Reichweite’ des FD Verfahrens befinden, muss die Courantzahl < 1 sein)"
    },
    {
        "image": "images/slide_77.png",
        "notes": "Frage: bisher nur Advektion betrachtet…"
    },
    {
        "image": "images/slide_78.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_79.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_80.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_81.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_82.png",
        "notes": "Numerische Dispersion\rNumerische Dispersion oder numerische Dämpfung bedeutet, dass Konzentrationsgradienten von einem numerischen Verfahren gegenüber der korrekten Lösung unterschätzt werden.\rDie numerische Näherungslösung führt dann dazu, dass Konzentrationsprofile flacher zu- und abnehmen. Konzentrationsmaxima (“peaks“) werden zu gering angegeben.\rDasselbe gilt sinngemäß für Durchbruchskurven."
    },
    {
        "image": "images/slide_83.png",
        "notes": "Dispersion als skalenabhängiger Parameter\rje größer die räumliche Skala, umso größer ist üblicherweise die Dispersion (z. B. infolge zunehmender geologischer Heterogeniäten im regionalen Umfeld)\rgrobe Faustregel: Dispersivität  ist ca. 1/10 der Transportstrecken bei üblichen Transportstrecken im Bereich von 100 … 10 000 m"
    },
    {
        "image": "images/slide_84.png",
        "notes": "Péclet Zahl\rDie Péclet-Zahl Pe ist ein Maß für die relative Bedeutung von Advektion und Dispersion für die Stoffausbreitung:\rUm den Bezug zu einem numerischen Verfahren zu verdeutlichen, wird diese Form der Péclet-Zahl häufig als Gitter-Péclet-Zahl bezeichnet.\rpraktisch kann die Gitter-Péclet-Zahl ein Kriterium sein, um die verfahrensbedingte numerische Dispersion zu minimieren\rüblicherweise fordern Rechenverfahren eine bestimmte Péclet-Zahl (oder kleiner); in der praktischen Konsequenz bedeutet das, dass die Zellweite klein(er) wird\rbei einer Péclet-Zahl von 1 entspricht die Gitterweite x gleich der Dispersivität "
    },
    {
        "image": "images/slide_85.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_86.png",
        "notes": "Fallbeispiel\rBerechnet wird der Transport von Nitrat in disketen Karströhren (entspricht einer 1D Stoffausbreitung)\rdie räumliche und zeitliche Skala ist sehr groß"
    },
    {
        "image": "images/slide_87.png",
        "notes": "Zeitliche Skala:\rBerechnung über mehrere Jahrzehnte mit einem expliziten Algorithmus\rdas Beispiel zeigt ein ‘Dilemma’:\rum numerische Dispersion zu minimieren, sollte die Péclet-Zahl klein sein, d.h. möglichst kleine Zellweiten\rum mit dem expliziten Algorithmus stabil zu rechnen, muss aber auch die Courant-Zahl kleiner 1 sein (im Beispiel sogar sehr klein, da die Fließgeschwindigkeit in den diskreten Karströhren hoch sein kann)\rErgebnis: kleine Zellen und damit auch sehr kleine Zeitschritte nötig"
    },
    {
        "image": "images/slide_88.png",
        "notes": "Abbildung zur Erläuterung / Ergänzung:\rgezeigt wird das Verhältnis von numerischer zu physikalischer Dispersion für verschiedenen Rechenverfahren\rd. h. eine Zahl/Isolinie von 2 bedeutet, dass die numerische Disperison zweimal so groß ist, wie die physikalische Dispersion …\rstabile und genaue Ergebnisse sind mit den FD Verfahren mit kleinen Zellen und kleinen Zeitschritten möglich (d. h. unter Umständen sehr langsame Rechnungen)"
    },
    {
        "image": "images/slide_89.png",
        "notes": "Dieses Thema ist eine Zusatzinfo – wird in der LV nur erwähnt"
    },
    {
        "image": "images/slide_90.png",
        "notes": "1D Stofftransport – Problemstellung\runendlich ausgedehntes Gebiet („sehr lange Laborsäule“)\rhomogenes poröses Medium\rgleichförmige stationäre Durchströmung\rquerschnittsbezogene Stoffmasse m [M/L²] zu Beginn (t = 0) „auf einen Punkt konzentriert“ (Koordinatenursprung)\rStoffausbreitung unterliegt der Advektion und der (mechanischen) Dispersion.\r\rKonzentrationsprofile\rDie Konzentrationsprofile sind (in diesem Beispiel) symmetrisch und glockenförmig.\rDas Konzentrationsmaximum liegt bei x = vt.\rDie (bzgl. m normierte) Maximalkonzentration beträgt 1/(4Dt).\rDie Flächen unter den normierten Konzentrationsprofilen sind stets gleich 1.\rÄhnlichkeiten mit der Normalverteilung sind nicht rein zufällig …"
    },
    {
        "image": "images/slide_91.png",
        "notes": "f(x) ist die Wahrscheinlichkeitsdichte einer normalverteilten Zufallsgröße X ~ N(,²) mit Mittelwert  und Varianz ² (bzw. Standardabweichung ).\rx ist hier die Variable der Dichtefunktion und keine Ortskoordinate."
    },
    {
        "image": "images/slide_92.png",
        "notes": "Die beiden rechten Seiten werden identisch, wenn man  = vt und ² = 2Dt setzt.\rvt ist die Position des Konzentrationsmaximums.\r2Dt ist ein Maß für die Breite des Konzentrationsprofils.\rDie Stoffausbreitung kann aufgrund dieser Analogie interpretiert werden als die Gesamtheit von Einzelbewegungen einer großen Zahl von Teilchen.\rDie Bewegung einzelner Teilchen setzt sich zusammen aus einer deterministischen Komponente (für die Advektion) und einer Zufallskomponente (für die Dispersion).\rDie Teilchendichte entspricht der Stoffkonzentration."
    },
    {
        "image": "images/slide_93.png",
        "notes": "Jedes Teilchen wird in einem Zeitintervall Δt aufgrund von Advektion um die Strecke v·Δt verschoben (vgl. Euler-Verfahren beim Particle Tracking).\rJedes Teilchen unterliegt zudem im Zeitintervall Δt einer zufälligen Bewegung aufgrund von Dispersion. Diese Verschiebung ist normalverteilt mit Mittelwert 0 und Varianz 2·D·Δt bzw. Standardabweichung (2·D·Δt).\rX ist eine Zufallszahl aus einer Standardnormalverteilung, d. h. X ~ N(0,1).\rDamit hat die dispersive Verschiebung wie gewünscht den Mittelwert 0 und die Standardabweichung (2·D·Δt) bzw. die Varianz 2·D·Δt.\rZufallszahlen für verschiedene Teilchen müssen statistisch unabhängig sein!"
    },
    {
        "image": "images/slide_94.png",
        "notes": "Haupteigenschaften\rRandom-Walk-Verfahren\rbasieren auf der Lagrange-Betrachtungsweise,\rermöglichen die Berücksichtigung der Dispersion und stellen somit eine Erweiterung des Particle-Tracking-Verfahrens dar,\runterliegen nicht der numerischen Dispersion (= verfahrensbedingte Dämpfung von Konzentrationsschwankungen),\rsind erweiterbar auf zwei und drei Raumdimensionen.\r\rDurchbruchskurven\rBei Verwendung von „zu wenigen“ Teilchen kann ein Random-Walk-Verfahren stark gezackte Durchbruchskurven (s. links) produzieren.\rDies gilt sinngemäß auch für Konzentrationsprofile bzw. -isolinien.\rAbhilfen:\r– mehr Teilchen\r– Glättungsverfahren \rNachteil:            Random-Walk-Verfahren können eine sehr hohe Teilchenanzahl (hohe Rechenzeit!) benötigen, falls dispersive Einflüsse bedeutend sind."
    },
    {
        "image": "images/slide_95.png",
        "notes": "Das Random-Walk-Verfahren benötigt Zufallszahlen X aus einer Standardnormalverteilung.\rZufallszahlengeneratoren liefern üblicherweise Zufallszahlen Z aus einer Gleichverteilung im Intervall von 0 bis 1, d. h. Z ~ U(0,1).\rMit Hilfe des Zentralen Grenzwertsatzes ist es möglich, Zufallszahlen (z. B. aus einer Gleichverteilung) so zu kombinieren, dass sich in guter Näherung eine Zufallszahl X aus der Standardnormalverteilung ergibt."
    },
    {
        "image": "images/slide_96.png",
        "notes": "Eine derartige Summe von Zufallsgrößen strebt gegen die Standardnormalverteilung.\rDie trifft insbesondere auf gleichverteilte Zufallsgrößen Zi aus der U(0,1)-Verteilung zu, die den Zufallszahlengeneratoren zugrunde liegt.\rFür die U(0,1)-Verteilung ist i = 1/2 und i² = 1/12."
    },
    {
        "image": "images/slide_97.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_98.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_99.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_100.png",
        "notes": "Grundidee\rCharakteristikenverfahren (MOC = “Method Of Characteristics“) gehören zu den „gemischten“ Verfahren zur Lösung der Stofftransportgleichung,   d. h. sie basieren auf Grundlagen der Euler- und der Lagrange-Betrachtungsweise.\rMit dieser Kombination sollen die jeweiligen Nachteile von numerischen Methoden reduziert werden, die auf einer reinen Euler- oder reinen Lagrange-Betrachtungsweise beruhen.\rNumerische Verfahren, die allein auf der Euler-Betrachtungsweise aufgebaut sind, weisen bei advektionsdominierten Problemen Schwächen auf.\rNumerische Verfahren, die allein auf der Lagrange-Betrachtungsweise aufgebaut sind, weisen bei dispersionsdominierten Problemen Schwächen auf.\rCharakteristikenverfahren zur Modellierung des konservativen Stofftransports im Grundwasser sind eine Kombination von\reinem Particle-Tracking-Verfahren zur Simulation der advektiven Stoffausbreitung und\reinem Finite-Differenzen-Verfahren zur Simulation der dispersiven Stoffausbreitung."
    },
    {
        "image": "images/slide_101.png",
        "notes": "Anfangsbedingung Partikelverteilung\rZur Simulation des advektiven Transports mittels MOC müssen Partikel und ihre Eigenschaften definiert werden. Insbesondere sind zu Beginn einer Simulation (t = 0) Startpunkte für die einzelnen Partikel festzulegen.\rDie zugehörige Anordnung von Partikeln in einer Zelle kann entweder regelmäßig oder zufällig sein. \rEntweder: (a) feste Anzahl von Partikeln für jede Zelle („gleichförmig“); Oder (b) höhere Anzahl von Partikeln in Bereichen mit stärkeren relativen Änderungen der Anfangskonzentrationen („dynamisch“)\rDie kleinere Anzahl von Partikeln nur in Bereichen mit geringen Konzentrationsunterschieden soll zu einer Verringerung der Rechenzeit ohne gleichzeitige Genauigkeitseinbußen beitragen.\rZur Quantifizierung von Konzentrationsunterschieden kann für eine Zelle (i,j) folgender Wert verwendet werden: {Gleichung dCij =} ; Dabei sind:\r– cmax0, cmin0 das Konzentrationsmaximum bzw. -minimum im Modellgebiet zur Zeit t = 0\r– cmax,ij0, cmin,ij0 das Konzentrationsmaximum bzw. -minimum im Fünf-Punkte-Stern um die Zelle (i,j) zur Zeit t = 0\rBei der „dynamischen“ Variante wird die Partikelanzahl in einer Zelle zum Anfangszeitpunkt in Abhängigkeit von Δcij0 entweder auf einen „hohen“ oder auf einen „niedrigen“ Wert gesetzt.\rDie „hohe“ Partikelanzahl wird gewählt, falls Δcij0 über einem vordefinierten Schwellenwert liegt. Andernfalls wird die „niedrige“ Partikelanzahl gewählt.\rTypische Werte: – Schwellenwert = 10-5 / – „hohe“ / niedrige Partikelanzahl = 25 / 0\rDer kleine Schwellenwert stellt sicher, dass auch in Bereichen mit geringeren Konzentrationsunterschieden noch Partikel platziert werden. Dies verringert erfahrungsgemäß Fehler in der Massenbilanz des Charakteristikenverfahrens."
    },
    {
        "image": "images/slide_102.png",
        "notes": "Anfangsbedingungen – Zuordnung von Konzentrationen\rBeim Random-Walk-Verfahren wird jedem Partikel zu Beginn der Simulation eine Masse zugeordnet.\rIm Gegensatz dazu wird beim Charakteristikenverfahren jedem Partikel eine Konzentration zugeordnet.\rDie Anfangskonzentration Cp0, die einem Partikel p zugeordnet wird (p = Partikelnummer), stimmt mit der Anfangskonzentration cij0 in der Zelle überein, in der sich dieses Partikel zu Beginn der Simulation befindet.\rDies wird sinngemäß auch für alle Partikel so gehandhabt, die zu einem späteren Zeitpunkt erstmals ins Modellgebiet „eingesetzt“ werden, z. B. im Zuge eines Stoffeintrags (Tracerinjektion o. dgl.)."
    },
    {
        "image": "images/slide_103.png",
        "notes": "Konzentrationen im neuen Zeitniveau\rMOC simuliert Advektion mit dem Particle-Tracking-Verfahren (Vorwärtsvariante).\rNach der Ausführung des advektiven Schritts werden die zugehörigen Zellkonzentrationen cij,advk als gewichtetes Mittel von Partikelkonzentrationen Cpk-1 berechnet {s. Gleichung in Abb.}\rDie Summen werden dabei über alle Partikel p gebildet, die sich nach dem advektiven Schritt in Zelle (i,j) befinden.\rDer Gewichtsfaktor Vp ist das Volumen der Zelle, in der sich das Partikel p zu Beginn der Simulation befunden hat! \rMit Hilfe eines FD-Verfahrens für Dispersion lassen sich die Zellkonzentrationen cijk im neuen Zeitniveau bestimmen.\rAnschließend werden die Partikel-konzentrationen Cpk für das neue Zeitniveau festgelegt.\rBei dieser Umrechnung ist sicherzustellen, dass keine negativen Partikelkonzentrationen auftreten.\rStoffentnahme („Senken“): Wegnahme von Partikeln bzw. Verringerung der Partikelkonzentrationen\rStoffeintrag („Quellen“): Hinzufügen neuer Partikel mit entsprechenden Konzentrationen\rDie mehrfachen Mittelungsbildungen, Interpolationen und Umrechnungen zwischen Zell- und Partikelkonzentrationen ergeben ein erhöhtes Potenzial für Massenbilanzfehler.\rDies ist ein wesentlicher Nachteil von MOC gegenüber anderen Verfahren."
    },
    {
        "image": "images/slide_104.png",
        "notes": "MMOC\rMMOC = „Modified Method Of Characteristics“ (modifiziertes Charakteristikenverfahren)\rWährend die advektive Stoffausbreitung von MOC per Vorwärts-Tracking simuliert wird, verwendet MMOC das Backward-Tracking.\rDabei wird pro Zelle nur ein Partikel benötigt (weniger Rechenzeit und Speicherplatz).\rDas Partikel soll sich im „neuen“ Zeitniveau k am Knoten (i,j) befinden.\rMit Backward-Tracking wird die advektive Verschiebung während des letzten Zeitschritts zurückgerechnet.\r\rDie Partikelkonzentration Cpk-1 zum „alten“ Zeitniveau k–1 wird interpoliert.\rZur Interpolation werden dabei die Konzentrationen cijk-1 benachbarter Knoten bzw. Zellen verwendet (inkl. Wichtung mit den Abständen zu diesen Knoten als Gewichtsfaktoren).\rDie Zellkonzentration cij,advk ist nach dem advektiven Schritt gerade gleich Cpk-1.\rDie Berechnung der Zell- und Partikelkonzentrationen cijk bzw. Cpk zum „neuen“ Zeitniveau erfolgt wie bei MOC mit Hilfe eines FD-Verfahrens bzw. einer Umrechnung.\r\rMMOC weist ähnliche Probleme bei der Massenbilanz auf wie MOC.\rHinzu kommt eine stärkere numerische Dispersion aufgrund der Interpolation für Cpk-1."
    },
    {
        "image": "images/slide_105.png",
        "notes": "HMOC\rHMOC = “Hybrid Method Of Characteristics“ (hybrides Charakteristikenverfahren)\rHMOC wurde entwickelt, um die Vorteile von MOC und MMOC zu vereinen.\rIn der Nähe von steilen Konzentrationsfronten wird die advektive Stoffausbreitung mittels MOC simuliert.\rDabei werden Partikel „dynamisch“ in der Nähe der Front eingesetzt und per Vorwärts-Tracking verfolgt.\rDieses Vorgehen reduziert die numerische Dispersion in der Nähe von steilen Konzentrationsfronten.\rIn anderen Teilen des Modellgebiets (d. h. in Bereichen ohne steile Konzentrationsfront) wird die Simulation auf der Basis von MMOC durchgeführt, um die Rechenzeiten niedrig zu halten.\rBzgl. Massenbilanzfehlern weist HMOC dieselben Probleme auf wie MOC oder MMOC.\rDes weiteren ist die Optimierung des Kriteriums, das über die Auswahl zwischen MOC und MMOC entscheidet, Gegenstand der Diskussion.\rStandardsoftware (z. B. MT3D) trifft diese Entscheidung „automatisch“ in Abhängigkeit von der aktuellen Konzentrationsverteilung in Teilen des Modellgebiets."
    },
    {
        "image": "images/slide_106.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_107.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_108.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_109.png",
        "notes": "TVD-Methode\r‘Methode der Wahl’ in MT3D\rGuter Kompromiss aus reduzierter num. Dispersion / Bilanztreue / Effizient\rGrundprinzip ähnlich wie die eingangs erläuterten FD-Verfahren\rAllerdings greift der Algorithmus auf ‘mehr Zellen’ zurück (nicht nur der linke / rechte Nachbar wie bei den FD Verfahren)"
    },
    {
        "image": "images/slide_110.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_111.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_112.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_113.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_114.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_115.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_116.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_117.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_118.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_119.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_120.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_121.png",
        "notes": "No notes"
    }
]