[
    {
        "image": "images/slide_1.png",
        "notes": "Willkommen zur Grundwasserbewirtschaftung mit Computermodellen – Thema 03: Numerische Lösung der Grundwasserströmungsgleichung (Fortsetzung) und Thema 04: Numerische Lösung der Transportgleichung\rNachfolgend die wichtigsten Folien, zum Teil mit Kommentaren (Stand 2022 11 03),\rIn der Veranstaltung vom 03. November 2022 haben wir die Inhalte bis zum Beginn von Thema 4 besprochen,\rNeben diesen Folien finden Sie im OPAL-Kurs weitere Materialien, u. a. elektronische Kontrollfragen,\rBei Fragen, Kommentaren und Hinweisen freuen wir uns von Ihnen zu hören."
    },
    {
        "image": "images/slide_2.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_3.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_4.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_5.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_6.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_7.png",
        "notes": "Begriffe\rKonservative Stoffe (inerte Stoffe, nicht-reaktive Stoffe) sind im Sicker- oder Grundwasser gelöste Stoffe, die während des Transports keinen physikalischen, chemischen oder biologischen Veränderungen unterliegen.\rUnter dem Begriff „konservativer Stofftransport“ werden dementsprechend alle Ausbreitungsprozesse zusammengefasst, die keine physikalischen, chemischen oder biologischen Veränderungen der gelösten Stoffe hervorrufen.\rDazu gehören Advektion (Konvektion), mechanische Dispersion und Porendiffusion.\rReaktive Stoffe unterliegen hingegen physikalischen, chemischen oder biologischen Veränderungen.\rZu den entsprechenden reaktiven Stofftransportprozessen gehören Sorption / Desorption, mikrobieller Abbau, radioaktiver Zerfall, geochemische Reaktionen."
    },
    {
        "image": "images/slide_8.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_9.png",
        "notes": "Transportmodelle für konservativen Stofftransport basieren auf\rdem Massenerhalt innerhalb von Kontrollvolumina (inkl. Zufuhr / Entnahme von Masse z. B. mittels Tracerinjektion oder über GWN)\rFließgesetzen für Advektion und Dispersion über die Grenzflächen benachbarter Kontrollvolumina\r\rn = (totale) Porosität = Wasservolumen / Kontrollvolumen [-]\rne= effektive Porosität= Volumen des mobilen Wassers / Kontrollvolumen [-]\rM = Aquifermächtigkeit [L]\rN = Grundwasserneubildung (GWN) [L/T]\rV = Abstandsgeschwindigkeit [L/T]\rD = Dispersionskoeffizient bzw. –tensor [L²/T]\rC = Stoffkonzentration (gelöst) = gelöste Stoffmasse / Wasservolumen [M/L³]\rC’ = Zugabe- bzw. Entnahmekonzentration (bei Zugabe: C’ ist vorzugeben; bei Entnahme: C’ = C) [M/L³]\rF = Massenfluss (= Stofffracht) [M/T]"
    },
    {
        "image": "images/slide_10.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_11.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_12.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_13.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_14.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_15.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_16.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_17.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_18.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_19.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_20.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_21.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_22.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_23.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_24.png",
        "notes": "Massenströme\rDie (konservative) Stoffausbreitung in einem Porengrundwasserleiter setzt sich grundsätzlich zusammen aus einer Überlagerung (Superposition) von Advektion, mechanischer Dispersion und Porendiffusion."
    },
    {
        "image": "images/slide_25.png",
        "notes": "Grundideen\rStrömung und Stofftransport können mit zwei Betrachtungsweisen behandelt werden, die auf Euler und Lagrange zurückgehen.\rEuler: Beobachter bzw. Kontrollvolumen in Ruhe\rLagrange: Beobachter bzw. Kontrollvolumen bewegt sich (rein advektiv) mit dem Fluid"
    },
    {
        "image": "images/slide_26.png",
        "notes": "Rein advektive Stoffausbreitung\rIn der Betrachtungsweise nach Lagrange ändert sich bei reiner Advektion die Stoffkonzentration in einem (mit dem Fluid bewegten!) Volumenelement nicht.\rIn der Betrachtungsweise nach Euler ändert sich bei reiner Advektion die Stoffkonzentration in einem (festen!) Volumenelement mit der Zeit.\rMan erhält eine zugehörige Durchbruchskurve, z. B.:"
    },
    {
        "image": "images/slide_27.png",
        "notes": "Überblick\rDie Euler- und die Lagrange-Betrachtungsweise lassen sich erweitern, um Dispersion mit zu berücksichtigen (spätere Vorlesung).\rVerfahren zur Simulation des Stofftransports wurden auf der Basis von beiden Betrachtungsweisen entwickelt.\rBei Euler-Verfahren wird ab und an auch von Euler-Gitterverfahren gesprochen, d. h. mit Hinweis auf das Gitter (= Finite Differenzen / Finite Elemente)"
    },
    {
        "image": "images/slide_28.png",
        "notes": "Weitere Bemerkung:\rDas Arbeitsblatt auf Folie 56 gibt bereits einen Einblick in die Problematik ‘Numerische Dispersion’"
    },
    {
        "image": "images/slide_29.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_30.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_31.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_32.png",
        "notes": "Überblick\rDie Euler- und die Lagrange-Betrachtungsweise lassen sich erweitern, um Dispersion mit zu berücksichtigen (spätere Vorlesung).\rVerfahren zur Simulation des Stofftransports wurden auf der Basis von beiden Betrachtungsweisen entwickelt.\rZudem gibt es Mischformen (vgl. Tabelle)."
    },
    {
        "image": "images/slide_33.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_34.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_35.png",
        "notes": "Einführung\rBahnlinienverfahren („Particle Tracking“) erlauben die Modellierung der advektiven Stoffausbreitung.\rDazu werden (virtuelle) Teilchen oder Partikel an vorgegebenen Punkten ins Strömungsfeld eingesetzt und ihre Bahnen verfolgt.\rAus der Bewegung der Teilchen lassen sich Rückschlüsse über die advektive Stoffausbreitung ziehen (Transportwege und -zeiten).\rModelltechnisch sind dafür Informationen erforderlich über\rdie zeitabhängigen Partikelkoordinaten xp(t) bzw. yp(t),\rdie Abstandsgeschwindigkeit v an der jeweiligen Partikelposition (sowohl x- als auch y-Komponente),\rdie Startzeit eines Partikels (nur bei instationärer Strömung). \r\rPartikel folgen den Stromlinien (Teilchenbahn = Stromlinie). \rDie Stromlinien und damit die Teilchenbahnen liegen tangential zu den Vektoren des Geschwindigkeitsfelds.\rWerden zwei Teilchen zu verschiedenen Zeiten an derselben Stelle in ein stationäres Geschwindigkeitsfeld eingesetzt, so sind ihre Bahnen identisch und für dieselben Transportwege werden dieselben Zeiten benötigt.\rDie Teilchenbahn ist unabhängig vom Startzeitpunkt eines Teilchens."
    },
    {
        "image": "images/slide_36.png",
        "notes": "Instationäre Strömung\rDie Stromlinien liegen tangential zu den Vektoren des (sich zeitlich ändernden!) Geschwindigkeitsfelds.\rTeilchen folgen der „momentanen“ Strömungsrichtung (Teilchenbahn ≠ Stromlinie!). \rWerden zwei Teilchen zu verschiedenen Zeiten an derselben Stelle in ein instationäres Geschwindigkeitsfeld eingesetzt, so sind ihre Bahnen nicht identisch.\rDie Teilchenbahn hängt vom Startzeitpunkt des Teilchens ab."
    },
    {
        "image": "images/slide_37.png",
        "notes": "Bei stationärer Strömung in zwei Raumdimensionen ergeben sich die zeitabhängigen Partikelkoordinaten xp(t) und yp(t) als Lösungen der Bewegungsgleichungen\rDabei sind vx und vy die ortsabhängigen Komponenten der Abstandsgeschwindigkeit.\rDie Bewegungsgleichungen besagen, dass sich die Partikelkoordinaten entsprechend der jeweiligen Komponente der Abstandsgeschwindigkeit ändern.\rDie Lösung der Bewegungsgleichungen erfolgt in den kommerziell erhältlichen Computerprogrammen entweder mit Hilfe eines numerischen Verfahrens oder auf der Basis einer analytischen (Näherungs-)Lösung.\rBeide Methoden benötigen Informationen über die x- und y-Komponente der Abstandsgeschwindigkeit an der Partikelposition.\rDiese Geschwindigkeitsinfo erhält man aus den Ergebnissen des Strömungsmodells."
    },
    {
        "image": "images/slide_38.png",
        "notes": "Das Bahnlinienverfahren von Euler stellt die einfachste numerische Lösung der Bewegungsgleichungen dar. \rDie Auswertung der Komponenten der Abstandsgeschwindigkeit erfolgt dabei jeweils für die Teilchenposition des „alten“ Zeitniveaus.\rÄnderungen der Abstandsgeschwindigkeitskomponenten auf dem Weg des Teilchens werden während des Zeitintervalls Δt nicht berücksichtigt.\rErst für den nächsten Zeitschritt findet wieder ein Update der Abstandsgeschwindigkeit statt."
    },
    {
        "image": "images/slide_39.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_40.png",
        "notes": "Im Gegensatz zum Euler-Verfahren basiert das Bahnlinienverfahren nach Pollock (1988) nicht auf einer numerischen, sondern auf einer analytischen Lösung der Bewegungsgleichungen.\rDabei wird eine spezielle Interpolationsvorschrift für Abstandsgeschwindigkeiten innerhalb jeder Zelle zugrunde gelegt.\rDiese Vorgehensweise ist z. B. in dem Computerprogramm MODPATH realisiert. (MODPATH ist z. B. Teil von ModelMuse.)\rDas Verfahren von Pollock vermeidet die numerischen Fehler des Euler-Verfahrens.\rAufgrund der o. g. Interpolationsvorschrift für die Abstandsgeschwindigkeiten liefert auch das Verfahren von Pollock „nur“ eine Näherungslösung für die Bahnlinien. Der Fehler ist i. a. jedoch erheblich geringer als etwa beim Euler-Verfahren.\rDas Verfahren von Pollock benötigt eine Reihe von Fallunterscheidungen (vgl. nächste Seite)."
    },
    {
        "image": "images/slide_41.png",
        "notes": "In der analytischen Lösung von Pollock ändert sich die Interpolationsformel für die Abstandsgeschwindigkeiten, sobald ein Teilchen während eines Zeitschritts über eine (mehrere) Zellkante(n) verschoben wird.\rDer Zeitschritt ist ggf. entsprechend zu unterteilen.\rFür jeden Abschnitt muss die zugehörige analytische Lösung gesondert ausgewertet werden.\rAnschließend wird der Transport-weg „zusammengestückelt“.\rDie weitgehende Elimination numerischer Fehler wird also durch einen erhöhten Buchhaltungsaufwand bei der Auswertung der analytischen Lösung erkauft."
    },
    {
        "image": "images/slide_42.png",
        "notes": "Diese Methode dient dazu, Fließwege entgegen der Strömungsrichtung zu verfolgen und wird auch als “Backward Tracking“ bezeichnet.\rWie bei der bisher behandelten Variante des Bahnlinienverfahrens (“Forward Tracking“) können auch hier Transportwege und -zeiten bestimmt werden.\r“Backward Tracking“ ist insbesondere für die Ausweisung von Wasserschutzgebieten von Interesse.\rDie Lösung kann mit allen Verfahren erfolgen, die sich für das „Forward Tracking“ eignen.\rLediglich das geänderte Vorzeichen der Abstandsgeschwindigkeit ist zu berücksichtigen."
    },
    {
        "image": "images/slide_43.png",
        "notes": "Partikel bewegen sich entlang der Stromlinien.\r“Backward Tracking“: Bewegung der Partikel ist der Strömungsrichtung entgegengesetzt.\rZusätzlich werden die Laufzeiten entlang der Stromlinien bestimmt.  \rIsochrone = Linie gleicher Laufzeit\rLage der Isochronen ist von der effektiven Porosität ne abhängig.\rVerlauf der Stromlinien ist nicht von der effektiven Porosität ne abhängig."
    },
    {
        "image": "images/slide_44.png",
        "notes": "No notes"
    }
]