[
    {
        "image": "images/slide_1.png",
        "notes": "Willkommen zur Grundwasserbewirtschaftung mit Computermodellen – Thema 04: Numerische Lösung der Transportgleichung\rSchwerpunkt im ersten Teil der Veranstaltung vom 10. November ist eine Einführung zu den Grundlagen des Transports gelöster Stoffe; die Folien / Notizen dazu finden Sie in den Unterlagen zu V04 (02. November 2023) ab ca. Folie 50;\rIn Teil 2 der Veranstaltung besprechen wir die Ausweisung von Schutzzonen für Wasserfassungen auf Basis von Partikeltracking;\rNachfolgend die wichtigsten Folien, zum Teil mit Kommentaren (2022 11 10 // 16:30 Uhr; Kommentare soweit ergänzt),\rNeben diesen Folien finden Sie im OPAL-Kurs weitere Materialien, u. a. elektronische Kontrollfragen,\rBei Fragen, Kommentaren und Hinweisen freuen wir uns von Ihnen zu hören."
    },
    {
        "image": "images/slide_2.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_3.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_4.png",
        "notes": "Praktische Fragestellung (Beispiel)\rWasserversorgung im Zusammenang mit landwirtschaftlicher Nutzung\rIn den Vorfeldmeßstellen wird eine erhöhte Konzentration von Nitrat festgestellt\rFrage(n):\rWie sehen die einzelnen Einzugsgebiete der Entnahmebrunnen aus?\rWoher stammt das Wasser, welches durch die Entnahmebrunnen gefördert wird?\rWie kann ggf. Die Wasserbeschaffenheit durch Maßnahmen im Einzugsgebiet optimiert werden (aber: hierei handelt es sich um eher langfristige Effekte)"
    },
    {
        "image": "images/slide_5.png",
        "notes": "Relevanz(!)\rAuch wenn vieles mit Computer und entsprechender Software realisiert werden kann, sind einfach Handrechnungen ein sehr wichtiger Aspekt (Grundverständnis, Kontrolle der Computerrechnungen)\rDie nachfolgenden Rechnungen zu Trennstromlinie und Einzugsgebiet sind solch einfache Handrechnungen"
    },
    {
        "image": "images/slide_6.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_7.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_8.png",
        "notes": "Situation in diesem Beispiel\ru. a. Interaktion mit Oberflächengewässern;\rUnterschiedliche Landnutzung"
    },
    {
        "image": "images/slide_9.png",
        "notes": "Beispiel\rMit dem Computermodell werden einige mögliche Varianten (-> Berücksichtigung von Unsicherheiten – s. auch die Abschnitte der LV zum konzeptionellen Modell)\rEinige numerisch berechnete Strömungsbahnen zeigen in der Abbildung das Einzugsgebiet der Wasserfassung"
    },
    {
        "image": "images/slide_10.png",
        "notes": "Beispiel zur Plausilibität (Trennstromlinie)\rVergleich der numerisch berechneten Varianten mit den Ergebnissen der ‘händisch’ / analytisch berechneten Trennstromlinie (für verschiedene hydr. Leitfähigkeiten)\rd. h. numerische Berechnungen plausible\rDie Berechnung der Trennstromlinie folgt in dieser Lehrveranstaltung"
    },
    {
        "image": "images/slide_11.png",
        "notes": "Beispiel zur Plausilibität (Isochronen / Zylinderformel)\rAbschätzung des Entahmebereichs mit der Zylinderformel\rNumerische Berechnung der Isochrone für 10 Jahre (gelber Bereich)\rPlausibilität des numerischen Modells\rBerechnung der Zylinderformel im weiteren Verlauf dieser Veranstaltung"
    },
    {
        "image": "images/slide_12.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_13.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_14.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_15.png",
        "notes": "Beispiel – Wasserstutzzonen im Freistatt Sachsen (Karte vom LfULG)"
    },
    {
        "image": "images/slide_16.png",
        "notes": "Beispiel – Wasserstutzzonen in Baden Württemberg (Karte vom LUBW)\rBereiche von BW sind im Untergrund verkarstet (z. B. schwäbische Alb)\rDamit sind die Schutzzonen bedeutend größer als im üblichen Lockergestein (z. B. relative hohe Abstandsgeschwindigkeiten in den Karströhren)"
    },
    {
        "image": "images/slide_17.png",
        "notes": "Wird aus einem Aquifer Wasser entnommen (z. B. durch Förderbrunnen) bildet sich ein Absenktrichter aus. Für den Entnahmebrunnen ergibt sich das Einzugsgebiet, d. h. innerhalb dieser Fläche erreicht neu gebildetes Grundwasser den Entnahmebrunnen."
    },
    {
        "image": "images/slide_18.png",
        "notes": "Wasserschutzgebiete sind in drei Zonen unterteilt. Die nachfolgenden Folien geben einen Überblick über die Intention der jeweiligen Zone und erläutern kurz, wie diese bestimmt / dimensioniert werden."
    },
    {
        "image": "images/slide_19.png",
        "notes": "In Deutschland wird für Schutzzone II die 50-Tage Isochrone verwendet. In anderen Teilen der Welt werden z. T. anderen Werte verwendet (z. B. 30-Tage Isochrone)."
    },
    {
        "image": "images/slide_20.png",
        "notes": "Die Schutzzone 3 umfasst das gesamte unterirdische Einzugsgebiet der Wasserfassung.\rHintergrund: ursprünglich wurde von pathogenen Keimen als Gefahrenquelle für die Wasserfassung ausgegangen (Hygiene).\rEntsprechend wurde die 50-Tage Isochrone (SZ II) ausgewiesen. Im Laufe der Zeit wurde aber auch in anderen Substanzen eine Gefahr für die Wasserfassung gesehen (z. B. gesundheitsgefährdende Stoffe, welche nicht bzw. nur sehr schwer abgebaut werden – persistente Schadstoffe).\rSchutzzone 3 (das gesamte EZG der Wasserfassung) soll durch entsprechende Restriktionen vermeiden, dass diese Stoffe in das Einzugsgebiet der Wasserfassung eingetragen werden."
    },
    {
        "image": "images/slide_21.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_22.png",
        "notes": "Beispiel zur Relevanz:\rIm Wasserschutzgebiet gibt es z. B. andere Anforderungen an den Verkehr (Straßenbau, ggf. Geschwindigkeitsbegrenzungen) mit dem Ziel, den Eintrag wassergefährdenter Stoffe zu vermeiden"
    },
    {
        "image": "images/slide_23.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_24.png",
        "notes": "Relevanz(!)\rAuch wenn vieles mit Computer und entsprechender Software realisiert werden kann, sind einfach Handrechnungen ein sehr wichtiger Aspekt (Grundverständnis, Kontrolle der Computerrechnungen)\rDie nachfolgenden Rechnungen zu Trennstromlinie und Einzugsgebiet sind solch einfache Handrechnungen"
    },
    {
        "image": "images/slide_25.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_26.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_27.png",
        "notes": "Die Zylinderformel ist eine sehr einfache Methode, um eine Isochrone abzuschätzen. Grundlage - idealisierte Situation (homogener / isotroper Aquifer):\rdas Grundwasser befindet sich in Ruhe (d. h. keine Hintergrundströmung, der natürliche Gradient I = 0).\rBei Wasserentnahme wird der Brunnen gleichmäßig von allen Seiten angeströmt.\rDie Isochronen bilden konzentrische Kreise um den Brunnen."
    },
    {
        "image": "images/slide_28.png",
        "notes": "(hier für den gespannten Fall)\rDas entnommene Volumen Q  t (Entnahmemenge mal Zeit) entspricht einem Zylinder mit dem Inhalt r2 (Umfang)  Mächtigkeit b (entspricht der Höhe des Zylinders)  effektive Porosität.\rUm die Isochrone zu ermitteln, muss die Gleichung nur nach dem Radius r umgestellt werden."
    },
    {
        "image": "images/slide_29.png",
        "notes": "Übungsaufgabe:\rHier einfach die Zylinderformel nach dem Radius umstellen\rDer Radius entspricht dem gesuchtem Ergebnis"
    },
    {
        "image": "images/slide_30.png",
        "notes": "Numerische Lösung der Übungsaufgabe – Partikeltracking\rEingangsdaten für das Partikeltracking sind die Ergebnisse der Strömungssimulation (s. rechte Seite – jeder Pfeil in der Abbildung repräsentiert einen berechneten Volumenstrom)\rAuf Basis der Volumenströme / Geschwindigkeiten wird die Laufbahn der ‘virtuellen’ Partikel berechnet\rEinfache Variante: Partikeltracking nach Euler\rNachteil: Aktuelle Geschwindigkeit wird extrapoliert; Änderungen im Verlauf der Wegbahn (z. B. gänderte Richtung) werden vernachlässigt"
    },
    {
        "image": "images/slide_31.png",
        "notes": "Numerische Lösung der Übungsaufgabe – Partikeltracking\rKomplexere Variante: Partikeltracking nach Runge-Kutta\rEs werden weitere Punkte im Verlauf der Strombahn berücksichtigt (d. h. wenn sich im Verlauf die Richtung / Geschwindigkeit ändert)\rErgebnis ist eine Mittelung"
    },
    {
        "image": "images/slide_32.png",
        "notes": "Numerische Lösung der Übungsaufgabe – Partikeltracking\rKomplexere Variante: Partikeltracking nach Pollock\rEs werden innerhalb der Zelle die Wegbahnen mit analytischen Gleichungen berechnet\rErgebnis ist, je nach räumlicher Diskretisierung, eine gute Näherung,"
    },
    {
        "image": "images/slide_33.png",
        "notes": "Numerische Lösung der Übungsaufgabe 1a\rMit Partikeltracking wird der gleiche Durchmesser der Isochrone ermittelt (im Vergleich zur Zylinderformel)\rDas numerische Modell ist im OPAL Kurs zu finden"
    },
    {
        "image": "images/slide_34.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_35.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_36.png",
        "notes": "Numerische Lösung der Übungsaufgabe 1b\rMit Partikeltracking wird ein vergleichbarer Durchmesser der Isochrone ermittelt (im Vergleich zur angepassten Zylinderformel)\rDas numerische Modell ist im OPAL Kurs zu finden"
    },
    {
        "image": "images/slide_37.png",
        "notes": "Testfrage:\rWelche Verfahren stehen hinter den Bahnen A, B und C?"
    },
    {
        "image": "images/slide_38.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_39.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_40.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_41.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_42.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_43.png",
        "notes": "Analytische Lösung für das Einzugsgebiet einer Wasserfassung (Trennstromlinie) für einen homogenen und gespannten Aquifer."
    },
    {
        "image": "images/slide_44.png",
        "notes": "Folgende Größen ergeben sich aus der analytischen Lösung (Achtung – Vorzeichen bei Abstand zum Kulminationspunkt). (Q = geförderte Wassermenge, K = hydraulische Leitfähigkeit, I = natürlicher Gradient des Grundwassers, b = wassererfüllte Mächtigkeit des Grundwasserleiters)."
    },
    {
        "image": "images/slide_45.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_46.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_47.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_48.png",
        "notes": "Numerische Lösung\rErgebnis verleichbar mit der analytischen (Hand)Rechnung\rModell ist im OPAL-Kurs zu finden"
    },
    {
        "image": "images/slide_49.png",
        "notes": "Trennstromlinie für den ungespannten Grundwasserleiter\rPrinzipiell vergleichbar\rIn der Lehrveranstaltung nicht näher erläutert (hier zur Vollständigkeit)"
    },
    {
        "image": "images/slide_50.png",
        "notes": "Theoretisch ist das Einzugsgebiet einer Wasserfassung unendlich lang; um die Fläche zu begrenzen, kann über die jährliche Grundwasserneubildung die Fläche von Schutzzone III (= Einzugsgebiet der Wasserfassung) abgeschätzt werden."
    },
    {
        "image": "images/slide_51.png",
        "notes": "Beispiel zur Ausweisung von Schutzzonen\rKarte vom LfULG (umwelt.Sachsen) - iDA\rStadt Hoyerswerda\rRot: Schutzzone I\rDunkelgrün: Schutzzone II\rHellgrün: Schutzzone IIIA\rGelb: Schutzzone IIIB"
    },
    {
        "image": "images/slide_52.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_53.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_54.png",
        "notes": "Übungsaufgabe 3\rAnwendung der händischen Rechnungen\rArbeitsblatt verwenden\rSchutzzonen endgültig auf Basis der Handrechnungen festlegen / Flurstücksgrenzen etc. berücksichtigen"
    },
    {
        "image": "images/slide_55.png",
        "notes": "Beispiel für die numerische Berechnung der Trennstromlinien\rLinks: Backward Partikel-Tracking; Zugabe der Partikel in den Brunnen / Rückrechnung -> Anzeige des EZG\rRechts: Forward Partikel-Tracking; Zugabe der Partikel im Einzugsgebiet (z. B. Zustrom Randbedingung) / Einzugsgebiet wird sichtbar"
    },
    {
        "image": "images/slide_56.png",
        "notes": "Ausblick\rLehrveranstaltung / Übungsaufgaben mit einfachen Beispielen für Lockergesteins-Grundwasserleiter\rFür komplexere Situationen sind diese Methoden eher beschränkt / nicht korrekt anwendbar;\rDie Abbildung zeigt als Beispiel die Schutzzonen für einen Karstgrundwasserleiter; es wird deutlich, dass Zone II im weiteren Einzugsgebiet verstreut ist (hier, wo es z. B. durch Schlucklöcher direkten Zugang in den Karstgrundwasserleiter gibt)."
    },
    {
        "image": "images/slide_57.png",
        "notes": "No notes"
    }
]