[
    {
        "image": "images/slide_1.png",
        "notes": "Willkommen zur Grundwasserbewirtschaftung mit Computermodellen – Thema [11]: Grundwasserneubildung\rSchwerpunkt der Veranstaltung ist die Grundwasserneubildung, als wichtige (Zufluss)-Randbedingung für Grundwassersysteme\rNachfolgend die wichtigsten Folien, zum Teil mit Kommentaren (Stand 2022 01 05 // 17:00 Uhr; Kommentare werden ggf. weiter ergänzt),\rNeben diesen Folien finden Sie im OPAL-Kurs weitere Materialien, u. a. Videos zu den Übungen und elektronische Kontrollfragen,\rBei Fragen, Kommentaren und Hinweisen freuen wir uns von Ihnen zu hören."
    },
    {
        "image": "images/slide_2.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_3.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_4.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_5.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_6.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_7.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_8.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_9.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_10.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_11.png",
        "notes": "Schwerpunkte / Ziele\rGrundwasserneubildung als wichtige Randbedingung verstehen und anwenden\rEinfache Rechnungen nach den Verfahren von \rRenger & Strebel\rBagrov & Glugla"
    },
    {
        "image": "images/slide_12.png",
        "notes": "Schwerpunkte / Ziele\rGrundwasserneubildung als wichtige Randbedingung verstehen und anwenden\rEinfache Rechnungen nach den Verfahren von \rRenger & Strebel\rBagrov & Glugla"
    },
    {
        "image": "images/slide_13.png",
        "notes": "Einführende Erläuterungen zur Unsicherheit\rDas System ist aus den bisherigen LV vertraut (Grabenanströmung), s. LV 02 bzw. auch https://mybinder.org/v2/gh/ThoReimann/HydroTeaching/master -> MWW01/MWW01_T02...\rZufluss hier über Grundwasserneubildung\rAbfluss über definiertes Potential\rals Funktion von Zufluss und hydraulischen Eigenschaften (K-Wert) stellt sich Druckpotential ein\rMessung Druckpotential (= Wasserstand) mittels Messstelle\rSystem ist nicht eindeutig, da …[n. Folie]"
    },
    {
        "image": "images/slide_14.png",
        "notes": "Mehrdeutigkeit\rSteigende Grundwasserneubildung kann durch einen reduzierten hydraulischen Widerstand K kompensiert werden (d. h. ein größerer K-Wert), wobei sich das Druckpotential nicht ändern muss\rEs ändert sich der Abfluss in die Randbedingung, dieser wird aber (typischerweise) nicht überwacht\rdieses Verständnis ist wichtig, da die GWN zusammen mit der hydraulischen LF Kalibrierparameter sind\rKonsequenz: GWN möglichst gut bestimmen (‘messen’) bzw. die Unsicherheiten im Bezug auf GWN-Daten kennen"
    },
    {
        "image": "images/slide_15.png",
        "notes": "Beispiel Wasserversorger\rbekanntes Beispiel"
    },
    {
        "image": "images/slide_16.png",
        "notes": "Beispiel\rverfügbare Daten zur Grundwasserneubildung Variante A (Quelle: LfULG – iDA)"
    },
    {
        "image": "images/slide_17.png",
        "notes": "Beispiel\rverfügbare Daten zur Grundwasserneubildung Variante B (Quelle: LfULG – iDA)"
    },
    {
        "image": "images/slide_18.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_19.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_20.png",
        "notes": "Bedeutung der Grundwasserneubildung\rGrundwasserneubildung ist eine wesentliche Eingangsgröße für  Computermodelle \rzur Ausweisung von Einzugsgebieten bei Versorgungsbrunnen (Schutzzone III), vgl. zugehörige Übung\rzur Unterstützung des Managements der Ressource Grundwasser\rzur Beurteilung der Schadstoffausbreitung im Grundwasser (Fließwege und Eintragskonzentrationen) \rGanz allgemein beeinflusst die Grundwasserneubildung die Grundwasserdynamik hinsichtlich Wassermengen, Fließwegen und Verweilzeiten.\rModelltechnisch kann sie als Randbedingung zweiter Art (Zufluss) oder als Quellterm implementiert werden."
    },
    {
        "image": "images/slide_21.png",
        "notes": "Erläuterung [in Englisch]\rShown is the catchment / flow divide for a production well (blue line)\rThe questions is, how much area should be considered for the catchment? (i.e. to define a water protection zone)\rTo answer this question, the relationship between pumping rate (= outflow) and recharge x area (= inflow) can be used\r\rThis diagram illustrate the effect of uncertainty related to recharge on the catchment size\rThe smaller the recharge rate, the bigger the catchment"
    },
    {
        "image": "images/slide_22.png",
        "notes": "Erläuterung [in Englisch]\rThe figure shows isolines of equal solute concentration (computed by some computer software)\rUpper part: without recharge, concentration is comparatively higher than in the lower part\rLower part: recharge results in dilution and overall lower concentrations"
    },
    {
        "image": "images/slide_23.png",
        "notes": "Komponenten der GWN:\rInfiltrationswasser: entsteht durch Wasser, welches an der Erdoberfläche versickert, z. B. Niederschlagswasser oder Wasser aus Oberflächengewässern (üblicherweise Hauptkomponente der GWN)\rKondensationswasser: Wasser aus Taubildung durch Temperaturunterschiede zwischen Tag und Nacht (kann in ariden Gebieten eine Rolle spielen)\rjuveniles Wasser: Wasser, das erstmals am Wasserkreislauf teilnimmt, z. B. magmatisches Wasser"
    },
    {
        "image": "images/slide_24.png",
        "notes": "Verbingung Bodenwasserhaushalt – GWN\rAbbildung zeigt den Verlauf des Wassergehalts über ein Jahr\rGWN findet statt, wenn die Feldkapazität überschritten wird (in der Abbildung blau markiert); d. h. die Grundwasserneubildung findet in Abhängigkeit von u. a. den bodenphysikalischen Eigenschaften zu bestimmten Zeiten statt"
    },
    {
        "image": "images/slide_25.png",
        "notes": "Example for recent (2020) drought conditions in Germany resulting in less recharge\rRight side figure: plot of two groundwater observation well (yellow and green line) together with a river stage (the river is called Parthe)\rThe groundwater head demonstrate that due to reduced recharge water levels significantly drop"
    },
    {
        "image": "images/slide_26.png",
        "notes": "Szenarien für die Grundwasserneubildung\rin A (linke Seite der Abbildung) ist eine einfache Situation dargestellt. Das Gelände ist eben (damit kein Oberflächenabfluss) und in der Bodenzone findet kein Zwischenabfluss statt. In diesem Fall ist die Grundwasserneubildung aus Niederschlage näherungsweise Niederschlag minus Evapotranspiration.\rin B wird die Sitatuion etwas komplexer aufgrund zusätzlicher Geländeneigung (Oberflächenabfluss) und Zwischenabfluss.\rin C weiterhin zusätzlich infiltrierendes Oberflächengewässer (auch möglich z. B. undichte Kanalisation etc.)."
    },
    {
        "image": "images/slide_27.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_28.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_29.png",
        "notes": "Größenordnung des Wasserdargebots für Deutschland\rAbbildung aus dem Hydrologischen Atlas Deutschland"
    },
    {
        "image": "images/slide_30.png",
        "notes": "Aufgabe / Frage:\rKompontenten im aktuellen Wasserhaushalt für ein definiertes Gebiet (hier Stadtgebiet Dresden)\rWenn Sie darüber nachdenken: es sollten einige sein…"
    },
    {
        "image": "images/slide_31.png",
        "notes": "Beispiel: Bodenwasserhaushalt\rEinfache Gleichung für den Bodenwasserhaushalt\rDer unterirdische Abfluss D ist nicht gleich die Grundwasserneubildung, da z. B. Zwischenabfluss stattfinden könnte (s. vorige Folien)"
    },
    {
        "image": "images/slide_32.png",
        "notes": "Beispiel Wasserbilanz für einen Grundwasserleiter\rAbbildung stellt einen ‘beliebigen’ Grundwasserleiter dar\r\rExplanation of variables:\rRrain is direct recharge from rainfall (m3); \rRF is irrigation return flow (m3); \rQon and Qoff are lateral groundwater flows into and out of the groundwater system (m3); \rQriver is river seepage recharge (m3); \rET is evapotranspiration (m3); \rPG is extraction of groundwater by pumping (m3); \rQbf is baseflow (groundwater discharge to streams or springs) (m3 ); and \rΔS is change in groundwater storage (m3). \rA positive ΔS indicates an increase in groundwater storage, while a negative ΔS represents a decrease in groundwater storage."
    },
    {
        "image": "images/slide_33.png",
        "notes": "Wasserbilanz – Schema aus Healy (2010)\rDie zugehörige Gleichung folgt auf der nächsten Folie\rSie können das Schema / die Gleichung mit dem Gedankenspiel ‘zur aktuellen Wasserbilanz von Dresden’ vergleichen (3 Folien zuvor)\r\rBedeutung der Abkürzungen:\rET = Evapotransp.\rP = Niederschlag\rR = Abfluss\rQ = Grundwasserabfluss\rD = Perkolation\rIndexe\rUZ = unsaturated zone\rgw = groundwater\rsw = surface water"
    },
    {
        "image": "images/slide_34.png",
        "notes": "Wasserbilanz\rDie Wasserbilanz kann viele Glieder umfassen und sehr umfangreich werden\rDamit lässt sich das System sehr gut Beschreiben, ABER:\rman müsste dazu auch die einzelnen Bilanzterme quantifizieren / messen können"
    },
    {
        "image": "images/slide_35.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_36.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_37.png",
        "notes": "Literaturempfehlung – Hydrogeology Journal 10 (01/2002)\rThemenheft zur Grundwasserneubildung\rUmfassende und bewährte Artikel\rZugang: https://link.springer.com/journal/10040/volumes-and-issues/10-1"
    },
    {
        "image": "images/slide_38.png",
        "notes": "Literaturempfehlung\rSehr gutes Buch / Buchbeitrag von R. Healy und J. Nimma (beide USGS)\rEmpfehlung, falls das Thema ‘Grundwasserneubildung’ im weiteren Verlauf des Studiums (noch starker) relevant werden sollte"
    },
    {
        "image": "images/slide_39.png",
        "notes": "Literaturempfehlung\rSehr gutes Buch / Buchbeitrag von R. Healy und J. Nimma (beide USGS)\rEmpfehlung, falls das Thema ‘Grundwasserneubildung’ im weiteren Verlauf des Studiums (noch starker) relevant werden sollte"
    },
    {
        "image": "images/slide_40.png",
        "notes": "Methoden – Ideensammlung\rGrundwasserneubildung ist ein Teil der (komplexen) Wasserbilanz\rmit welchen Methoden kann / könnte die Grundwasserneubildung ermittelt werden?"
    },
    {
        "image": "images/slide_41.png",
        "notes": "Methoden, um die Grundwasserneubildung zu bestimmen / zu messen:\res existiert eine Vielzahl von Methoden\rAusgangspunkt ist überwiegend, die einzelnen Glieder der Wasserbilanz zu bestimmen (z. B. Evapotranspiration)\rdiese können nach verschiedenen Kriterien sortiert werden\rdie Struktur / Gliederung der Methoden stammt aus Scanlon et al. (2002) – Hydrogeology Journal 10 (01/2002): https://link.springer.com/article/10.1007/s10040-001-0176-2"
    },
    {
        "image": "images/slide_42.png",
        "notes": "Schema\raus der Litertur (Scanlon et al.2002)\rKategorien für die verschiedenen Methoden"
    },
    {
        "image": "images/slide_43.png",
        "notes": "Beispiel Abflussmodellierung\rEmpirisches Modell zur Bestimmung der Wasserhaushaltsgrößen\rErgebnis ist die flächendifferenzierte Grundwasserneubildung\rweitere Informationen z. B. https://www.bad-wuennenberg.de/medien/bindata/2378b-Anhang9_2-Methodenbeschreibung-GWNB-Modelle.pdf"
    },
    {
        "image": "images/slide_44.png",
        "notes": "Zeitliche Variation\rDas Beispiel (langjährige Daten aus Botswana) zeigt die hohe zeitliche Variation der Grundwasserneubildung\rebenfalls deutlich wird, wie der Grundwasserspiegel auf die Neubildung reagiert\rim Beispiel ist die zeitliche Variation sehr ausgeprägt"
    },
    {
        "image": "images/slide_45.png",
        "notes": "Beispiel – Direkte Messung der Wasserbilanzterme mit Lysimetern\rLysimeterstation Wagna (Steiermark)\rInformationen u. a. http://lysimeter.com"
    },
    {
        "image": "images/slide_46.png",
        "notes": "Direkte Berechnung der Wasserströmung in der Bodenzone / ungesättigten Zone\rBasis sind Strömungsgleichungen für die ungesättigte Zone, z. B. Richards-Gleichung\rmit entsprechenden Modellen sowie mit den nötigen Parametern und Randbedingungen (z. B. Niederschlag) kann die Grundwasserneubildung berechnet werden"
    },
    {
        "image": "images/slide_47.png",
        "notes": "Richards Gleichung – Grundsätzliche Vorgehensweise und Probleme\rDie Anwendung der Richards-Gleichung setzt die Kenntnis der Funktionen K(θ) und θ(ψ) voraus.\rBei Vorgabe dieser beiden Funktionen ist die Lösung der Richards-Gleichung mit numerischen Verfahren möglich. \rBeispiele für entsprechende Softwarepakete: Hydrus, Daisy, Wave, Richy\rProbleme:\r\t–\tDie benötigten Funktionsparameter hängen vom Bodenmaterial ab.\r\t–\tSie können sogar innerhalb eines Bodentyps starken Schwankungen unterliegen, sodass eine Parameterbestimmung für jeden Einzelfall erforderlich ist.\r\t–\tDer Zusammenhang zwischen Wasserspannung ψ und Bodenfeuchte θ ist zudem häufig durch Hysterese gekennzeichnet.\rDie Parametrisierung der Funktionsverläufe von K(θ) und θ(ψ) ist somit schwierig und aufwändig.\rBenötigte Daten stehen i. d. R. nicht oder zumindest nicht in ausreichendem Umfang zur Verfügung."
    },
    {
        "image": "images/slide_48.png",
        "notes": "Beispiel für die Berechnung im Zusammenhang mit MODFLOW\rUZF Package (simuliert Strömung in der ungesättigten Zone)\rstatt RCH (wie z. B. im Beleg) wird in UZF der Niederschlag in Kombination mit weiteren Parametern (Bodenhydraulik, Verdunstung) verwendet\rErgebnis der Berechnung ist die Grundwasserneubildung"
    },
    {
        "image": "images/slide_49.png",
        "notes": "Beispiel WTF Methoden\rAnnahme: Grundwasserneubildung führt zum Ansteigen der Druckpotentiale\rAnstieg Grundwasserspiegel (dh) über einen Zeitraum (dt) wird mit dem effektiven Porenraum (SY = specific yield ~ effective Porosität)\rProblem: bis zu welcher Basis wird dh gemessen? Die Spitze ist klar, aber die Basis muss aus einer Projektion des Wasserspiegels abgeschätzt werden\rVorgehen demonstriert ein Beispiel-Video in OPAL"
    },
    {
        "image": "images/slide_50.png",
        "notes": "Beispiel WTF\rSY ~ 0.1 (Annahme – z. T. schluffige / lehmige Sedimente im Untergrund)\rEbenfalls Annahme: kein Einfluss von ‘Randbedingungen’ (hier z. B. Elbe)"
    },
    {
        "image": "images/slide_51.png",
        "notes": "Beispiel Chlorid-Methode\rBasis ist die Chloridkonzentration in Niederschlag und Grundwasser\rMit einer Mischungsrechnung kann die Grundwasserneubildung berechnet werden\rgut geeignet, um auch geringe Grundwasserneubildung zu quantifizieren (z. B. sehr aride Gebiete wie Wüsten)"
    },
    {
        "image": "images/slide_52.png",
        "notes": "Beispiel – Wasserbilanz für ein Einzugsgebiet\rBasis ist die Wasserbilanz für ein definiertes Gebiet (IN = OUT)"
    },
    {
        "image": "images/slide_53.png",
        "notes": "Wasserbilanz / Wasserwerksmethode\rWasserbilanz für das Einzugsgegbiet eines Brunnens\rBei bekannter Größe des Einzugsgebietes und bekannter Entnahmerate kann die Grundwasserneubildung abgeschätzt werden"
    },
    {
        "image": "images/slide_54.png",
        "notes": "Übungsaufgabe 1\rVideo zur Lösung im OPAL Kurs"
    },
    {
        "image": "images/slide_55.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_56.png",
        "notes": "Überblick zu den Methoden\rDie Abbildungen zeigen, für welche Größenordnungen (Menge der GWN) die einzelnen Methoden geeignet sind"
    },
    {
        "image": "images/slide_57.png",
        "notes": "Überblick zu den Methoden\rDie Abbildungen zeigen, für welche Flächen die einzelnen Methoden aussagefähig sind"
    },
    {
        "image": "images/slide_58.png",
        "notes": "Überblick zu den Methoden\rDie Abbildungen zeigen, für welche Zeiträume die einzelnen Methoden aussagefähig sind"
    },
    {
        "image": "images/slide_59.png",
        "notes": "Überblick zu den Methoden\rDie Abbildungen zeigen, für welche Zeiträume die einzelnen Methoden aussagefähig sind"
    },
    {
        "image": "images/slide_60.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_61.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_62.png",
        "notes": "Einflussgröße Landnutzung\rThe figure shows an areal view for a random region\rYou can differentiate between forest / agriculture / urban areas\rIf just some average number for recharge is available, you still can differentiate spatial distribution if the landuse is known (e.g. there is more recharge under acres in comparison to forest)"
    },
    {
        "image": "images/slide_63.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_64.png",
        "notes": "Einflussfaktor Niederschlag\rNiederschlag in Form von Regen, Schnee, Nebel, Tau, Reif\rDominante Einflußgröße auf die GWN ist die Niederschlagsmenge.\rWinterniederschläge tragen stärker zur GWN bei als Sommerniederschläge.\rZur Berechnung der GWN ist die räumliche Verteilung des Niederschlags wichtig.\rVerfahren zur Auswertung von Daten vorhandener Messstationen (z. B. DWD): \r\t– Polygonmethode\r\t– Isohyetenmethode"
    },
    {
        "image": "images/slide_65.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_66.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_67.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_68.png",
        "notes": "Bei geringem Grundwasserflurabstand können Pflanzen Grundwasser nutzen.\rDieser Effekt wirkt sich bis ca. 2.5 m unter GOK aus."
    },
    {
        "image": "images/slide_69.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_70.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_71.png",
        "notes": "Schwerpunkte / Ziele\rGrundwasserneubildung als wichtige Randbedingung verstehen und anwenden\rEinfache Rechnungen nach den Verfahren von \rRenger & Strebel\rBagrov & Glugla"
    },
    {
        "image": "images/slide_72.png",
        "notes": "Berechnung der GWN mit dem Verfahren nach Bagrov-Glugla\rweit verbreitete Anwendung im Osten von Deutschland (ehem. DDR)\rDer Bagrov-Faktor hängt ab von der Bodenart, von Bodeneigenschaften und von der Ertragsklasse (Landwirtschaft).\rDer Bagrov-Faktor kann aus Lysimetermessungen ermittelt werden.\rDas Verfahren von Bagrov-Glugla bestimmt mit einem relative einfachen Ansatz die mittlere jährliche Grundwasserneubildung (Basis sind langjährige Datenreihen)\rVariation innerhalb eines Jahres / zwischen verschiedenen (z. B. trockenen / feuchten) Jahren wird nicht weiter differenziert"
    },
    {
        "image": "images/slide_73.png",
        "notes": "Bagrov-Faktor:\reinfache grafische Bestimmung mit Nomogrammen für landwirtschaftlich genutzte Flächen und Wälder\rim linken Diagramm auf der x-Achse ist die Bodenart verzeichnet (Delta 0.02 bezeichnet den abschlämmbaren Bodenanteil, d. h. Sedimentdurchmesser < 0.02 mm\rdie Ertragsklasse ist ein Parameter aus der Landwirtschaft\rd. h. n = f (Boden, Landnutzung)"
    },
    {
        "image": "images/slide_74.png",
        "notes": "Das Nomogramm stellt auf der x-Achse das Verhältniss von Niederschlag und potentieller Verdunstung (Eingangsgrößen) dar\rmit dem Bagrov-Faktor n (s. vorige Folie) kann das Verhältnis von realer zu potentieller Verdunstung abgelesen werden, d. h. es kann die reale Verdunstung ETR bestimmt werden\rdie Grundwasserneubildung ergibt sich dann als R = P - ETR\r\rBei den Ergebnissen des Bagrov-Verfahrens handelt es sich um langjährige Mittelwerte.\rFür geringe Grundwasserflurabstände (< 1 m; bei Wald < 2 m) ist           ETR = ETP.\rFür Wasserflächen ist ETR = 700 mm.\rDas Bagrov-Verfahren ist nicht anwendbar für kontinentales, arides Klima mit P < ETP/2."
    },
    {
        "image": "images/slide_75.png",
        "notes": "Übungsaufgabe\rLösung als Video in OPAL"
    },
    {
        "image": "images/slide_76.png",
        "notes": "Beispiel rechnen:\rNiederschlag langjähriges Mittel 825mm\rETP 535 mm\rP/ETP = 1.54\rAcker; abschlämmbare Bodenteilchen 40% mit Ertragsklasse 33 -> Nomogramm ablesen n = ~2.2\rNomogramm ablesen ETR=0.93 ETP; ETR = 498mm\rGWN = 825 – 498 = 327 mm"
    },
    {
        "image": "images/slide_77.png",
        "notes": "Anwendung\rfür Darstellung in Rasterdaten (Karten, ähnlich das Eingangsbeispiel für den Wasserersorger der Lausitz)\rDie Festlegung des Bagrov-Faktors er-folgt nach Glugla durch Berücksichtigung der Bodenart, von Bodeneigenschaften und der Ertragsklasse.\rDabei wurden Bodenkarten sowie In-formationen aus der Landwirtschaft verwendet."
    },
    {
        "image": "images/slide_78.png",
        "notes": "Aktuelle Anwendung\rBAGLUVA\rgreift auf div. Datenbanken / -quellen zurück"
    },
    {
        "image": "images/slide_79.png",
        "notes": "Ergebnisse Bagluva\rKarte der Grundwasserneubildung\rVerifiziert mit Lysimterdaten für diverse Einzugsgebiete"
    },
    {
        "image": "images/slide_80.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_81.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_82.png",
        "notes": "Berechnung der Grundwasserneubildung nach Renger und Strebel - Grundlage:\rAuswertung von Feldversuchen zum Bodenwasserhaushalt für 20 Standorte\rZusammenhang zwischen Niederschlag (differenziert bzgl. Winter und Sommer), potenzieller Verdunstung (ETP nach Haude) und pflanzenverfügbarer Bodenwassermenge\rAufstellen von Regressionsgleichungen und Bestimmung der Regressionsparameter"
    },
    {
        "image": "images/slide_83.png",
        "notes": "pflanzenverfügbare Wassermenge für grundwassernahe Standorte:\u000bWPfl = nFK·We + KA mit KA = kapillarer Aufstieg (wenn relevant)\rBeispiel:\rnFK = 13 mm / dm \rWe = 7 dm\rWpfl = 13 mm / dm x 7 dm = 91 mm\rkapillarer Aufstieg: KA = Kr·ta mit Kr = Rate des kapillaren Aufstiegs, ta = Dauer des kapillaren Aufstiegs\rKr aus bodenkundl. Kartieranleitung\rta = Hauptwachstumszeit (Getreide: 60 d, Hackfrüchte und Mais: 90 d; Grünland: 120 d)"
    },
    {
        "image": "images/slide_84.png",
        "notes": "Nomogramm (als alternative zu den eingangs vorgestellten Regressionsgleichungen)\rstarten mit Wpfl\rSchnittpunkt mit Winter- und Sommerniederschlag suchen\rETP als nächster Schnittpunkt\rGWN ablesen"
    },
    {
        "image": "images/slide_85.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_86.png",
        "notes": "Beispiel\rfür die Übungsaufgabe gibt es ein VIDEO im Opal-Kurs"
    },
    {
        "image": "images/slide_87.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_88.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_89.png",
        "notes": "No notes"
    },
    {
        "image": "images/slide_90.png",
        "notes": "Die nachfolgenden Folien geben einen kurzen Überblick zu den Möglichkeiten, wie Grundwasserneubildung in MODFLOW implementiert werden kann\rRCH (Recharge)\rdirekte Eingabe der GWN als Randbedingung zweiter Art\rzeitliche Variation möglich, indem im Modell verschiedene Perioden definiert werden (innerhalb der Periode ist die GWN konstant)\u000b\u000bVerdunstung mittels EVT\rAbbildung (links) aus dem Manual\r\rVerdunstung mittels EVT\rblauer Pfeil zeigt die Tiefe (z-Achse)\rGrüner Pfeil ziegt die Größe der Verdunstung\rbis h_0 wirkt die maximale Verdungstung\rüber den Bereich d nimmt die Wirksamkeit der Verdunstung linear ab"
    },
    {
        "image": "images/slide_91.png",
        "notes": "MODFLOW-UZF\rUZF (unsaturated zone flow) bildet die Strömung in der ungesättigten Zone (vereinfacht) ab\rursprünglich entwickelt, um die Infiltration aus entkoppelten Oberflächengewässern besser zu beschreiben (rot markierter Bereich in der Abbildung)\rbei entkoppelten Oberflächengewässern kann dass infiltrierende Wasser eine längere Zeit bis zum Grundwasserleiter benötigen (z. B. wenn sich dieser weit unterhalb des Oberflächengewässers befindet); ebenso werden Speicherprozesse wirksam (z. B. bei geringer Bodenfeuchte)\rEingangsparameter für UZF sind u. a.\rNiederschlag\rVerdunstung\rBrooks-Corey Exponent für die Beschreibung des Saugspannungs-Sättigungsverhaltens des Untergrundes"
    },
    {
        "image": "images/slide_92.png",
        "notes": "Berechnung UZF\rdunkelblau Linie zeigt Benetzung (Befeuchtungsfront)\rdurchgezogene Linie = reale Verteilung der Feuchte\rgepunktete Linie = vereinfachte Abbildung in UZF als Blockströmung\rhellblaue Linie zeigt Abtrocknung (nach Ende der Infiltration)\rdurchgezogene Linie = reale Verteilung der Feuchte\rgepunktete Linie = vereinfachte Abbildung in UZF als stufenförmige Blockfunktion"
    }
]